using System;
using System.Collections;
using System.Collections.Generic;
using System.IO;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
//using System.Text;
using System.Threading.Tasks;
using System.Speech.Synthesis;
using System.Speech.AudioFormat;
using System.Speech.Recognition;
using System.Windows.Forms;
using System.Runtime.Serialization.Formatters.Binary;
using System.Runtime.Serialization;
using System.Media;


namespace NekoSensei
{
    
    public partial class  Form1 : Form
    {

        //global variables *************************************


        [Serializable()]//persistent user records
        public class Userstatistics
        {
            public int[] superwords = new int[50]; //marked by user as repeating
            public int successwordcount = 0;
            public bool[] chapterselection = new bool[47];
            public bool[] modeselection=new bool[5];
            public int[,] wordrecord = new int[2, 1810];  //have the words been played: one column listen, one column talk
        }

       public Userstatistics newstats = new Userstatistics();

       

        string[,] monsterstring = new string[1810, 5]{{"-","ありがとう。", "Thank you.", "0", "1"},
{"-","ありがとうございます。", "Thank you. (polite)", "0", "2"},
{"-","いいえ。", "No.; Not at all.", "0", "3"},
{"-","いただきます。", "Thank you for the meal. (before eating)", "0", "4"},
{"-","いってきます。", "I’ll go and come back.", "0", "5"},
{"-","いってらっしゃい。", "Please go and come back.", "0", "6"},
{"-","おかえり（なさい）。", "Welcome home.", "0", "7"},
{"-","おはよう。", "Good morning.", "0", "8"},
{"-","おはようございます。", "Good morning. (polite)", "0", "9"},
{"-","おやすみ（なさい）。", "Good night.", "0", "10"},
{"-","ごちそうさま（でした）。", "Thank you for the meal. (after eating)", "0", "11"},
{"-","こんにちは。", "Good afternoon.", "0", "12"},
{"-","こんばんは。", "Good evening.", "0", "13"},
{"-","さようなら。", "Good-bye.", "0", "14"},
{"-","すみません。", "Excuse me.; I’m sorry.", "0", "15"},
{"-","ただいま。", "I’m home.", "0", "16"},
{"-","はじめまして。", "First time hello", "0", "17"},
{"よろしくお願いします","よろしくおねがいします。", "Nice to meet you.", "0", "18"},
{"アジア研究","アジアけんきゅう。", "Asian studies", "1", "19"},
{"-","あの。", "um . . .", "1", "20"},
{"一年生","いちねんせい。", "first-year student", "1", "21"},
{"今","いま。", "now", "1", "22"},
{"英語","えいご。", "English language", "1", "23"},
{"-","ええ。", "yes", "1", "24"},
{"科学","かがく。", "science", "1", "25"},
{"学生","がくせい。", "student", "1", "26"},
{"～語","～ご。", ". . . language", "1", "27"},
{"高校","こうこう。", "high school", "1", "28"},
{"高校生","こうこうせい。", "high school student", "1", "29"},
{"国際関係","こくさいかんけい。", "international relations", "1", "30"},
{"午後","ごご。", "P.M.", "1", "31"},
{"午前","ごぜん。", "A.M.", "1", "32"},
{"-","～さん。", "Mr./Ms. . . .", "1", "33"},
{"～時","～じ。", "o’clock", "1", "34"},
{"主婦","しゅふ。", "housewife", "1", "35"},
{"～人","～じん。", ". . . people", "1", "36"},
{"人類学","じんるいがく。", "anthropology", "1", "37"},
{"-","スウェーデン。", "Sweden", "1", "38"},
{"専攻","せんこう。", "major", "1", "39"},
{"先生","せんせい。", "teacher; Professor . . .", "1", "40"},
{"-","そうです。", "That’s right.", "1", "41"},
{"-","そうですか。", "I see.; Is that so?", "1", "42"},
{"大学","だいがく。", "college; university", "1", "43"},
{"大学院生","だいがくいんせい。", "graduate student", "1", "44"},
{"電話","でんわ。", "telephone", "1", "45"},
{"友だち","ともだち。", "friend", "1", "46"},
{"名前","なまえ。", "name", "1", "47"},
{"何","なん。", "what", "1", "48"},
{"二時半","にじはん。", "half past two", "1", "49"},
{"日本","にほん。", "Japan", "1", "50"},
{"日本語","にほんご。", "Japanese language", "1", "51"},
{"日本人","にほんじん。", "Japanese people", "1", "52"},
{"～年生","～ねんせい。", ". . . year student", "1", "53"},
{"-","はい。", "yes", "1", "54"},
{"半","はん。", "half", "1", "55"},
{"番号","ばんごう。", "number", "1", "56"},
{"留学生","りゅうがくせい。", "international student", "1", "57"},
{"私","わたし。", "I", "1", "58"},
{"一時","いちじ。", "one o’clock", "1", "59"},
{"～歳","～さい。", ". . . years old", "1", "60"},
{"医者","いしゃ。", "doctor", "1", "61"},
{"-","オーストラリア。", "Australia", "1", "62"},
{"政治","せいじ。", "politics", "1", "63"},
{"弁護士","べんごし。", "lawyer", "1", "64"},
{"-","アメリカ。", "U.S.A.", "1", "65"},
{"-","イギリス。", "Britain", "1", "66"},
{"お母さん","おかあさん。", "mother", "1", "67"},
{"お父さん","おとうさん。", "father", "1", "68"},
{"韓国","かんこく。", "Korea", "1", "69"},
{"経済","けいざい。", "economics", "1", "70"},
{"-","コンピューター。", "computer", "1", "71"},
{"中国","ちゅうごく。", "China", "1", "72"},
{"-","ビジネス。", "business", "1", "73"},
{"歴史","れきし。", "history", "1", "74"},
{"妹（さん）","いもうと（さん）。", "younger sister", "1", "75"},
{"弟（さん）","おとうと（さん）。", "younger brother", "1", "76"},
{"お兄さん","おにいさん。", "older brother", "1", "77"},
{"お姉さん","おねえさん。", "older sister", "1", "78"},
{"会社員","かいしゃいん。", "office worker", "1", "79"},
{"仕事","しごと。", "job; work; occupation", "1", "80"},
{"大学生","だいがくせい。", "college student", "1", "81"},
{"文学","ぶんがく。", "literature", "1", "82"},
{"一歳","いっさい。", "one year old", "1.1", "83"},
{"一分","いっぷん。", "one minute", "1.1", "84"},
{"九歳","きゅうさい。", "nine years old", "1.1", "85"},
{"九分","きゅうふん。", "nine minutes", "1.1", "86"},
{"九時","くじ。", "nine o’clock", "1.1", "87"},
{"五歳","ごさい。", "five years old", "1.1", "88"},
{"五時","ごじ。", "five o’clock", "1.1", "89"},
{"五分","ごふん。", "five minutes", "1.1", "90"},
{"三歳","さんさい。", "three years old", "1.1", "91"},
{"三時","さんじ。", "three o’clock", "1.1", "92"},
{"三十分","さんじっぷん/さんじゅっぷん。", "thirty minutes", "1.1", "93"},
{"三分","さんぷん。", "three minutes", "1.1", "94"},
{"七時","しちじ。", "seven o’clock", "1.1", "95"},
{"十歳","じっさい。", "ten years old", "1.1", "96"},
{"十分","じっぷん。", "ten minutes", "1.1", "97"},
{"十一時","じゅういちじ。", "eleven o’clock", "1.1", "98"},
{"十一歳","じゅういっさい。", "eleven years old", "1.1", "99"},
{"十一分","じゅういっぷん。", "eleven minutes", "1.1", "100"},
{"十九分","じゅうきゅうふん。", "nineteen minutes", "1.1", "101"},
{"十五分","じゅうごふん。", "fifteen minutes", "1.1", "102"},
{"十三分","じゅうさんぷん。", "thirteen minutes", "1.1", "103"},
{"十時","じゅうじ。", "ten o’clock", "1.1", "104"},
{"十七分","じゅうななふん。", "seventeen minutes", "1.1", "105"},
{"十二時","じゅうにじ。", "twelve o’clock", "1.1", "106"},
{"十二分","じゅうにふん。", "twelve minutes", "1.1", "107"},
{"十八分","じゅうはちふん/じゅうはっぷん。", "eighteen minutes", "1.1", "108"},
{"十四分","じゅうよんぷん。", "fourteen minutes", "1.1", "109"},
{"十六分","じゅうろっぷん。", "sixteen minutes", "1.1", "110"},
{"十歳","じゅっさい。", "ten years old", "1.1", "111"},
{"十分","じゅっぷん。", "ten minutes", "1.1", "112"},
{"七歳","ななさい。", "seven years old", "1.1", "113"},
{"七分","ななふん。", "seven minutes", "1.1", "114"},
{"二歳","にさい。", "two years old", "1.1", "115"},
{"二時","にじ。", "two o’clock", "1.1", "116"},
{"二十分","にじっぷん。", "twenty minutes", "1.1", "117"},
{"二十分","にじゅっぷん。", "twenty minutes", "1.1", "118"},
{"二分","にふん。", "two minutes", "1.1", "119"},
{"二十歳","はたち。", "twenty years old", "1.1", "120"},
{"八時","はちじ。", "eight o’clock", "1.1", "121"},
{"八分","はちふん。", "eight minutes", "1.1", "122"},
{"八歳","はっさい。", "eight years old", "1.1", "123"},
{"八分","はっぷん。", "eight minutes", "1.1", "124"},
{"四時","よじ。", "four o’clock", "1.1", "125"},
{"四歳","よんさい。", "four years old", "1.1", "126"},
{"四分","よんぷん。", "four minutes", "1.1", "127"},
{"六歳","ろくさい。", "six years old", "1.1", "128"},
{"六時","ろくじ。", "six o’clock", "1.1", "129"},
{"六分","ろっぷん。", "six minutes", "1.1", "130"},
{"-","あそこ。", "over there", "2", "131"},
{"-","あの。", "that . . . (over there)", "2", "132"},
{"-","あれ。", "that one (over there)", "2", "133"},
{"-","いくら。", "how much", "2", "134"},
{"-","いらっしゃいませ。", "Welcome (to our store).", "2", "135"},
{"～円","～えん。", ". . . yen", "2", "136"},
{"-","おいしい。", "delicious", "2", "137"},
{"-","おねがいします（～を）。", ". . ., please.", "2","138"},
{"傘","かさ。", "umbrella", "2", "139"},
{"喫茶店","きっさてん。", "cafe", "2", "140"},
{"銀行","ぎんこう。", "bank", "2", "141"},
{"-","ください。", "Please give me . . .", "2", "142"},
{"靴","くつ。", "shoes", "2", "143"},
{"-","ここ。", "here", "2", "144"},
{"-","この。", "this . . .", "2", "145"},
{"-","これ。", "this one", "2", "146"},
{"財布","さいふ。", "wallet", "2", "147"},
{"魚","さかな。", "fish", "2", "148"},
{"-","ジーンズ。", "jeans", "2", "149"},
{"自転車","じてんしゃ。", "bicycle", "2", "150"},
{"-","じゃあ。", "then . . . ; if that is the case, . . .", "2","151"},
{"新聞","しんぶん。", "newspaper", "2", "152"},
{"-","そこ。", "there", "2", "153"},
{"-","その。", "that . . .", "2", "154"},
{"-","それ。", "that one", "2", "155"},
{"高い","たかい。", "expensive; high", "2", "156"},
{"-","だれ。", "who", "2", "157"},
{"-","テイーシャツ。", "T-shirt", "2", "158"},
{"-","トイレ。", "toilet, restroom", "2","159"},
{"-","どうぞ。", "Please.; Here it is.", "2", "160"},
{"-","どうも。", "Thank you.", "2", "161"},
{"時計","とけい。", "watch; clock", "2", "162"},
{"-","どこ。", "where", "2", "163"},
{"図書館","としょかん。", "library", "2", "164"},
{"-","どの。", "which . . .", "2", "165"},
{"-","どれ。", "which one", "2", "166"},
{"-","とんかつ。", "pork cutlet", "2", "167"},
{"肉","にく。", "meat", "2", "168"},
{"-","ノート。", "notebook", "2", "169"},
{"帽子","ぼうし。", "hat; cap", "2", "170"},
{"-","メニュー。", "menu", "2", "171"},
{"野菜","やさい。", "vegetable", "2", "172"},
{"郵便局","ゆうびんきょく。", "post office", "2", "173"},
{"鉛筆","えんぴつ。", "pencil", "2", "174"},
{"-","かばん。", "bag", "2", "175"},
{"辞書","じしょ。", "dictionary", "2", "176"},
{"-","ペン。", "pen", "2", "177"},
{"本","ほん。", "book", "2", "178"},
{"消しゴム","けしゴム。", "eraser", "2.1", "179"},
{"-","ドア。", "door", "2.1", "180"},
{"-","アイスクリーム。", "ice cream", "3", "181"},
{"朝","あさ。", "morning", "3", "182"},
{"朝ご飯","あさごはん。", "breakfast", "3", "183"},
{"-","あまり。", "not much  ＋ negative", "3", "184"},
{"-","いい。", "good", "3", "185"},
{"家","いえ。", "home; house", "3", "186"},
{"行く","いく。", "to go", "3", "187"},
{"-","いつ。", "when", "3", "188"},
{"-","うち。", "home; house; my place", "3", "189"},
{"映画","えいが。", "movie", "3", "190"},
{"起きる","おきる。", "to get up", "3", "191"},
{"お酒","さけ。", "sake; alcohol", "3", "192"},
{"お茶","おちゃ。", "green tea", "3", "193"},
{"音楽","おんがく。", "music", "3", "194"},
{"帰る","かえる。", "to go back; to return", "3", "195"},
{"学校","がっこう。", "school", "3", "196"},
{"聞く","きく。", "to listen; to hear", "3", "197"},
{"来る","くる。", "to come", "3", "198"},
{"-","コーヒー。", "coffee", "3", "199"},
{"-","～ごろ。", "at about . . .", "3", "200"},
{"今晩","こんばん。", "tonight", "3", "201"},
{"酒","さけ。", "sake; alcohol", "3", "202"},
{"雑誌","ざっし。", "magazine", "3", "203"},
{"週末","しゅうまつ。", "weekend", "3", "204"},
{"-","スポーツ。", "sports", "3", "205"},
{"-","する。", "to do", "3", "206"},
{"全然","ぜんぜん。", "not at all ＋ negative", "3", "207"},
{"-","そうですね。", "That’s right.; Let me see.", "3", "208"},
{"-","たいてい。", "usually", "3", "209"},
{"食べる","たべる。", "to eat", "3", "210"},
{"茶","おちゃ。", "green tea", "3", "211"},
{"-","ちょっと。", "a little", "3", "212"},
{"-","デート。", "date (romantic, not calendar)", "3","213"},
{"-","テニス。", "tennis", "3", "214"},
{"-","でも。", "but", "3", "215"},
{"-","テレビ。", "TV", "3", "216"},
{"-","どうですか。", "How about . . . ?; How is . . . ?", "3", "217"},
{"時々","ときどき。", "sometimes", "3", "218"},
{"寝る","ねる。", "to sleep; to go to sleep", "3", "219"},
{"飲む","のむ。", "to drink", "3", "220"},
{"話す","はなす。", "to speak; to talk", "3", "221"},
{"早い","はやい。", "early", "3", "222"},
{"晩ご飯","ばんごはん。", "dinner", "3", "223"},
{"-","ハンバーガー。", "hamburger", "3", "224"},
{"昼ご飯","ひるごはん。", "lunch", "3", "225"},
{"勉強する","べんきょうする。", "to study", "3", "226"},
{"毎日","まいにち。", "every day", "3", "227"},
{"毎晩","まいばん。", "every night", "3", "228"},
{"水","みず。", "water", "3", "229"},
{"見る","みる。", "to see; to look at; to watch", "3", "230"},
{"-","よく。", "often; much", "3", "231"},
{"読む","よむ。", "to read", "3", "232"},
{"明日","あした。", "tomorrow", "3", "233"},
{"今日","きょう。", "today", "3", "234"},
{"日曜日","にちようび。", "Sunday", "3", "235"},
{"土曜日","どようび。", "Saturday", "3", "236"},
{"-","いす。", "chair", "4", "237"},
{"机","つくえ。", "desk", "4", "238"},
{"間","あいだ。", "between", "4", "239"},
{"会う","あう。", "to meet; to see (a person)", "4", "240"},
{"-","あなた。", "you", "4", "241"},
{"-","ある。", "there is . . .", "4", "242"},
{"-","アルバイト。", "part-time job", "4", "243"},
{"一時間","いちじかん。", "one hour", "4", "244"},
{"犬","いぬ。", "dog", "4", "245"},
{"-","いる。", "(a person) is in . . . ; stays at . . .", "4", "246"},
{"上","うえ。", "on", "4", "247"},
{"後ろ","うしろ。", "back", "4", "248"},
{"お寺","おてら。", "temple", "4", "249"},
{"お土産","おみやげ。", "souvenir", "4", "250"},
{"買い物","かいもの。", "shopping", "4", "251"},
{"買う","かう。", "to buy", "4", "252"},
{"書く","かく。", "to write", "4", "253"},
{"-","～ぐらい。", "about (approximate measurement)", "4", "254"},
{"-","クラス。", "class", "4", "255"},
{"公園","こうえん。", "park", "4", "256"},
{"子供","こども。", "child", "4", "257"},
{"ご飯","ごはん。", "rice; meal", "4", "258"},
{"-","ごめんなさい。", "I’m sorry.", "4", "259"},
{"～時間","～じかん。", ". . . hours", "4", "260"},
{"下","した。", "under", "4", "261"},
{"写真","しゃしん。", "picture; photograph", "4", "262"},
{"-","スーパー。", "supermarket", "4", "263"},
{"-","だから。", "so; therefore", "4", "264"},
{"-","たくさん。", "many; a lot", "4", "265"},
{"近く","ちかく。", "near; nearby", "4", "266"},
{"手紙","てがみ。", "letter", "4", "267"},
{"-","デパート。", "department store", "4", "268"},
{"寺","てら。", "temple", "4", "269"},
{"-","～と。", "together with (a person)", "4", "270"},
{"-","どうして。", "why", "4", "271"},
{"時","とき。", "when . . . ; at the time of . . .", "4", "272"},
{"隣","となり。", "next", "4", "273"},
{"撮る","とる。", "to take (a picture)", "4", "274"},
{"中","なか。", "inside", "4", "275"},
{"猫","ねこ。", "cat", "4", "276"},
{"バス停","バスてい。", "bus stop", "4", "277"},
{"-","パン。", "bread", "4", "278"},
{"左","ひだり。", "left", "4", "279"},
{"人","ひと。", "person", "4", "280"},
{"一人で","ひとりで。", "alone", "4", "281"},
{"病院","びょういん。", "hospital", "4", "282"},
{"-","ホテル。", "hotel", "4", "283"},
{"本屋","ほんや。", "bookstore", "4", "284"},
{"前","まえ。", "front", "4", "285"},
{"町","まち。", "town; city", "4", "286"},
{"待つ","まつ。", "to wait", "4", "287"},
{"右","みぎ。", "right", "4", "288"},
{"土産","みやげ。", "souvenir", "4", "289"},
{"-","メール。", "e-mail", "4", "290"},
{"-","レストラン。", "restaurant", "4", "291"},
{"-","わかる。", "to understand", "4", "292"},
{"火曜日","かようび。", "Tuesday", "4", "293"},
{"昨日","きのう。", "yesterday", "4", "294"},
{"金曜日","きんようび。", "Friday", "4", "295"},
{"月曜日","げつようび。", "Monday", "4", "296"},
{"水曜日","すいようび。", "Wednesday", "4", "297"},
{"先週","せんしゅう。", "last week", "4", "298"},
{"木曜日","もくようび。", "Thursday", "4", "299"},
{"一月","いちがつ。", "January", "4.1", "300"},
{"五日","いつか。", "the fifth day of a month", "4.1", "301"},
{"-","おととし。", "the year before last", "4.1", "302"},
{"九月","くがつ。", "September", "4.1", "303"},
{"五月","ごがつ。", "May", "4.1", "304"},
{"九日","ここのか。", "the ninth day of a month", "4.1", "305"},
{"再来月","さらいげつ。", "the month after next", "4.1", "306"},
{"再来週","さらいしゅう。", "the week after next", "4.1", "307"},
{"再来年","さらいねん。", "the year after next", "4.1", "308"},
{"三月","さんがつ。", "March", "4.1", "309"},
{"四月","しがつ。", "April", "4.1", "310"},
{"七月","しちがつ。", "July", "4.1", "311"},
{"十一月","じゅういちがつ。", "November", "4.1", "312"},
{"十一日","じゅういちにち。", "the eleventh day of a month", "4.1", "313"},
{"十月","じゅうがつ。", "October", "4.1", "314"},
{"十二月","じゅうにがつ。", "December", "4.1", "315"},
{"十四日","じゅうよっか。", "the fourteenth day of a month", "4.1", "316"},
{"一日","ついたち。", "the first day of a month", "4.1", "317"},
{"十日","とおか。", "the tenth day of a month", "4.1", "318"},
{"七日","なのか。", "the seventh day of a month", "4.1", "319"},
{"二か月前","にかげつまえ。", "two months ago", "4.1", "320"},
{"二月","にがつ。", "February", "4.1", "321"},
{"二週間前","にしゅうかんまえ。", "two weeks ago", "4.1", "322"},
{"二十四日","にじゅうよっか。", "the twenty-fourth day of a month", "4.1", "323"},
{"八月","はちがつ。", "August", "4.1", "324"},
{"二十日","はつか。", "the twentieth day of a month", "4.1", "325"},
{"二日","ふつか。", "the second day of a month", "4.1", "326"},
{"三日","みっか。", "the third day of a month", "4.1", "327"},
{"六日","むいか。", "the sixth day of a month", "4.1", "328"},
{"八日","ようか。", "the eighth day of a month", "4.1", "329"},
{"四日","よっか。", "the fourth day of a month", "4.1", "330"},
{"六月","ろくがつ。", "June", "4.1", "331"},
{"-","おまんじゅう。", "sweet bun", "4.3", "332"},
{"-","まんじゅう。", "sweet bun", "4.3", "333"},
{"新しい","あたらしい。", "new", "5", "334"},
{"熱い","あつい。", "hot (thing)", "5", "335"},
{"暑い","あつい。", "hot (weather)", "5", "336"},
{"忙しい","いそがしい。", "busy (people/days)", "5", "337"},
{"一緒に","いっしょに。", "together", "5", "338"},
{"海","うみ。", "sea", "5", "339"},
{"大きい","おおきい。", "large", "5", "340"},
{"面白い","おもしろい。", "interesting; funny", "5", "341"},
{"泳ぐ","およぐ。", "to swim", "5", "342"},
{"-","かっこいい。", "good-looking", "5", "343"},
{"聞く","きく。", "to ask", "5", "344"},
{"切符","きっぷ。", "ticket", "5", "345"},
{"嫌い","きらい（な）。", "disgusted with; to dislike", "5", "346"},
{"-","きれい（な）。", "beautiful; clean", "5", "347"},
{"元気","げんき（な）。", "healthy; energetic", "5", "348"},
{"怖い","こわい。", "frightening", "5", "349"},
{"-","サーフィン。", "surfing", "5", "350"},
{"寒い","さむい。", "cold (weather)", "5", "351"},
{"静か","しずか（な）。", "quiet", "5", "352"},
{"好き","すき（な）。", "fond of; to like", "5", "353"},
{"-","すごく。", "extremely", "5", "354"},
{"-","それから。", "and then", "5", "355"},
{"大嫌い","だいきらい（な）。", "to hate", "5", "356"},
{"大丈夫","だいじょうぶ。", "It’s okay.; Not to worry.; Everything is under control.", "5", "357"},
{"大好き","だいすき（な）。", "very fond of; to love", "5", "358"},
{"楽しい","たのしい。", "fun", "5", "359"},
{"食べ物","たべもの。", "food", "5", "360"},
{"誕生日","たんじょうび。", "birthday", "5", "361"},
{"小さい","ちいさい。", "small", "5", "362"},
{"-","つまらない。", "boring", "5", "363"},
{"出かける","でかける。", "to go out", "5", "364"},
{"-","テスト。", "test", "5", "365"},
{"天気","てんき。", "weather", "5", "366"},
{"-","とても。", "very", "5", "367"},
{"-","どんな。", "what kind of . . .", "5", "368"},
{"-","にぎやか（な）。", "lively", "5", "369"},
{"飲み物","のみもの。", "drink", "5", "370"},
{"乗る","のる。", "to ride; to board", "5", "371"},
{"-","バス。", "bus", "5", "372"},
{"飛行機","ひこうき。", "airplane", "5", "373"},
{"暇","ひま（な）。", "not busy; to have a lot of free time", "5", "374"},
{"古い","ふるい。", "old (thing)", "5", "375"},
{"部屋","へや。", "room", "5", "376"},
{"僕","ぼく。", "I (used by men)", "5", "377"},
{"-","～まで。", "to (a place); as far as (a place); till (a time)", "5", "378"},
{"難しい","むずかしい。", "difficult", "5", "379"},
{"-","やさしい。", "easy (problem); kind (person)", "5", "380"},
{"安い","やすい。", "inexpensive; cheap (thing)", "5", "381"},
{"休み","やすみ。", "holiday; day off; absence", "5", "382"},
{"-","やる。", "to do; to perform", "5", "383"},
{"旅行","りょこう。", "travel", "5", "384"},
{"宿題","しゅくだい。", "homework", "5", "385"},
{"～枚","～まい。", "[counter for flat objects]", "5", "386"},
{"切手","きって。", "postal stamps", "5", "387"},
{"葉書","はがき。", "postcard", "5", "388"},
{"書留","かきとめ。", "registered mail", "5.1", "389"},
{"航空便","こうくうびん。", "airmail", "5.1", "390"},
{"小包","こづつみ。", "parcel", "5.1", "391"},
{"速達","そくたつ。", "special delivery", "5.1", "392"},
{"船便","ふなびん。", "surface mail", "5.1", "393"},
{"窓口","まどぐち。", "counter", "5.1", "394"},
{"お城","おしろ。", "castle", "5.2", "395"},
{"～様","～さま。", "Mr./Ms. . . .", "5.2", "396"},
{"城","しろ。", "castle", "5.2", "397"},
{"では、お元気で","では、おげんきで。", "Take care.", "5.2", "398"},
{"-","メキシコ。", "Mexico", "5.2", "399"},
{"窓","まど。", "window", "6", "400"},
{"電気","でんき。", "electricity", "6", "401"},
{"今週","こんしゅう。", "this week", "6", "402"},
{"来週","らいしゅう。", "next week", "6", "403"},
{"来年","らいねん。", "next year", "6", "404"},
{"開ける","あける。", "to open (something)", "6", "405"},
{"遊ぶ","あそぶ。", "to play; to spend time pleasantly", "6", "406"},
{"後で","あとで。", "later on", "6", "407"},
{"急ぐ","いそぐ。", "to hurry", "6", "408"},
{"お金","おかね。", "money", "6", "409"},
{"教える","おしえる。", "to teach; to instruct", "6", "410"},
{"お風呂","おふろ。", "bath", "6", "411"},
{"お風呂に入る","おふろにはいる。", "to take a bath", "6", "412"},
{"降りる","おりる。", "to get off", "6", "413"},
{"返す","かえす。", "to return (a thing)", "6", "414"},
{"金","おかね。", "money", "6", "415"},
{"-","～から。", "because . . .", "6", "416"},
{"借りる","かりる。", "to borrow", "6", "417"},
{"漢字","かんじ。", "kanji; Chinese character", "6", "418"},
{"教科書","きょうかしょ。", "textbook", "6", "419"},
{"消す","けす。", "to turn off; to erase", "6", "420"},
{"結構です","けっこうです。", "That would be fine", "6", "421"},
{"-","シーディー。", "CD", "6", "422"},
{"死ぬ","しぬ。", "to die", "6", "423"},
{"市民病院","しみんびょういん。", "municipal hospital", "6", "424"},
{"閉める","しめる。", "to close (something)", "6", "425"},
{"-","シャワー。", "shower", "6", "426"},
{"シャワーを浴びる","シャワーをあびる。", "to take a shower", "6", "427"},
{"-","すぐ。", "right away", "6", "428"},
{"座る","すわる。", "to sit down", "6", "429"},
{"立つ","たつ。", "to stand up", "6", "430"},
{"たばこを吸う","たばこをすう。", "to smoke", "6", "431"},
{"使う","つかう。", "to use", "6", "432"},
{"次","つぎ。", "next", "6", "433"},
{"-","つける。", "to turn on", "6", "434"},
{"連れてくる","つれてくる。", "to bring (a person)", "6", "435"},
{"手伝う","てつだう。", "to help", "6", "436"},
{"電車","でんしゃ。", "train", "6", "437"},
{"電話をかける","でんわをかける。", "to make a phone call", "6", "438"},
{"荷物","にもつ。", "baggage", "6", "439"},
{"入る","はいる。", "to enter", "6", "440"},
{"-","パソコン。", "personal computer", "6", "441"},
{"風呂","おふろ。", "bath", "6", "442"},
{"風呂に入る","おふろにはいる。", "to take a bath", "6", "443"},
{"-","ページ。", "page", "6", "444"},
{"本当ですか","ほんとうですか。", "Really?", "6", "445"},
{"持つ","もつ。", "to carry; to hold", "6", "446"},
{"持ってくる","もってくる。", "to bring (a thing)", "6", "447"},
{"休む","やすむ。", "to be absent (from); to rest", "6", "448"},
{"-","ゆっくり。", "slowly; leisurely; unhurriedly", "6", "449"},
{"忘れる","わすれる。", "to forget; to leave behind", "6", "450"},
{"遅く","おそく。", "(do something) late", "6", "451"},
{"大変","たいへん（な）。", "tough (situation)", "6", "452"},
{"夜","よる。", "night", "6", "453"},
{"北","きた。", "north", "6.1", "454"},
{"西","にし。", "west", "6.1", "455"},
{"東","ひがし。", "east", "6.1", "456"},
{"左側","ひだりがわ。", "left side", "6.1", "457"},
{"一つ目","ひとつめ。", "first", "6.1", "458"},
{"二つ目","ふたつめ。", "second", "6.1", "459"},
{"右側","みぎがわ。", "right side", "6.1", "460"},
{"渡る","わたる。", "to cross", "6.1", "461"},
{"南","みなみ。", "south", "6.1", "462"},
{"-","まっすぐ。", "straight", "6.1", "463"},
{"-","イタリア。", "Italy", "6.3", "464"},
{"-","シェフ。", "chef", "6.3", "465"},
{"料理","りょうり。", "cooking; dish", "6.3", "466"},
{"-","ワイン。", "wine", "6.3", "467"},
{"頭がいい","あたまがいい。", "bright; smart; clever", "7", "468"},
{"姉","あね。", "(my) older sister", "7", "469"},
{"-","アパート。", "apartment", "7", "470"},
{"歌","うた。", "song", "7", "471"},
{"歌う","うたう。", "to sing", "7", "472"},
{"-","おじいさん。", "grandfather; old man", "7", "473"},
{"男の人","おとこのひと。", "man", "7", "474"},
{"-","おばあさん。", "grandmother; old woman", "7", "475"},
{"女の人","おんなのひと。", "woman", "7", "476"},
{"会社","かいしゃ。", "company", "7", "477"},
{"-","めがねをかける。", "to put on glasses", "7", "478"},
{"家族","かぞく。", "family", "7", "479"},
{"-","かぶる。", "to put on (a hat)", "7", "480"},
{"-","かわいい。", "cute", "7", "481"},
{"兄弟","きょうだい。", "brothers and sisters", "7", "482"},
{"着る","きる。", "to put on (clothes above your waist)", "7", "483"},
{"国","くに。", "country; place of origin", "7", "484"},
{"車","くるま。", "car", "7", "485"},
{"-","ゲーム。", "game", "7", "486"},
{"結婚する","けっこんする。", "to get married", "7", "487"},
{"-","コンビニ。", "convenience store", "7", "488"},
{"-","サークル。", "club activity", "7", "489"},
{"知っています","しっています。", "I know", "7", "490"},
{"食堂","しょくどう。", "cafeteria; dining commons", "7", "491"},
{"知りません","しりません。", "I do not know", "7", "492"},
{"知る","しる。", "to get to know", "7", "493"},
{"親切","しんせつ（な）。", "kind", "7", "494"},
{"住む","すむ。", "to live", "7", "495"},
{"背が高い","せがたかい。", "tall (stature)", "7", "496"},
{"背が低い","せがひくい。", "short (stature)", "7", "497"},
{"父","ちち。", "(my) father", "7", "498"},
{"勤める","つとめる。", "to work for", "7", "499"},
{"-","DVD（ディーブイディー）。", "DVD", "7", "500"},
{"長い","ながい。", "long", "7", "501"},
{"何も","なにも。", "not . . . anything ＋ negative", "7", "502"},
{"～人","～にん。", "[counter for people]", "7", "503"},
{"-","はく。", "to put on (items below your waist)", "7", "504"},
{"母","はは。", "(my) mother", "7", "505"},
{"速い","はやい。", "fast", "7", "506"},
{"一人","ひとり。", "one person", "7", "507"},
{"二人","ふたり。", "two people", "7", "508"},
{"太っています","ふとっています。", "to be on the heavy side", "7", "509"},
{"太る","ふとる。", "to gain weight", "7", "510"},
{"別に","べつに。", "nothing in particular ＋ negative", "7", "511"},
{"便利","べんり（な）。", "convenient", "7", "512"},
{"短い","みじかい。", "short (length)", "7", "513"},
{"眼鏡","めがね。", "glasses", "7", "514"},
{"-","もしもし。", "Hello? (used on the phone)", "7", "515"},
{"-","もちろん。", "of course", "7", "516"},
{"-","やせています。", "to be thin", "7", "517"},
{"-","やせる。", "to lose weight", "7", "518"},
{"-","よかったら。", "if you like", "7", "519"},
{"髪","かみ。", "hair", "7", "520"},
{"口","くち。", "mouth", "7", "521"},
{"目","め。", "eye", "7", "522"},
{"-","～が。", ". . ., but", "7","523"},
{"頭","あたま。", "head", "7.1", "524"},
{"-","おしり。", "buttocks", "7.1", "525"},
{"肩","かた。", "shoulder", "7.1", "526"},
{"首","くび。", "neck", "7.1", "527"},
{"-","しり。", "buttocks", "7.1", "528"},
{"背中","せなか。", "back (body)", "7.1", "529"},
{"鼻","はな。", "nose", "7.1", "530"},
{"耳","みみ。", "ear", "7.1", "531"},
{"胸","むね。", "breast", "7.1", "532"},
{"指","ゆび。", "finger", "7.1", "533"},
{"手","て。", "hand; arm", "7.1", "534"},
{"体に気をつける","からだにきをつける。", "to take care of oneself", "7.2", "535"},
{"楽しみにする","たのしみにする（～を）。", "to look forward (to)", "7.2", "536"},
{"黒板","こくばん。", "blackboard", "8", "537"},
{"-","あさって。", "the day after tomorrow", "8", "538"},
{"今月","こんげつ。", "this month", "8", "539"},
{"来月","らいげつ。", "next month", "8", "540"},
{"雨","あめ。", "rain", "8", "541"},
{"雨が降る","あめがふる。", "it rains", "8", "542"},
{"洗う","あらう。", "to wash", "8", "543"},
{"言う","いう。", "to say", "8", "544"},
{"-","いる。", "to need", "8", "545"},
{"-","ううん。", "uh-uh; no", "8", "546"},
{"-","うん。", "uh-huh; yes", "8", "547"},
{"運転する","うんてんする。", "to drive", "8", "548"},
{"遅くなる","おそくなる。", "to be late", "8", "549"},
{"思う","おもう。", "to think", "8", "550"},
{"-","カメラ。", "camera", "8", "551"},
{"-","カラオケ。", "karaoke", "8", "552"},
{"乾杯","かんぱい。", "Cheers! (a toast)", "8", "553"},
{"空気","くうき。", "air", "8", "554"},
{"今朝","けさ。", "this morning", "8", "555"},
{"残念（ですね）","ざんねん（ですね）。", "That’s too bad.", "8", "556"},
{"上手","じょうず（な）。", "skillful; good at . . .", "8", "557"},
{"じろじろ見る","じろじろみる。", "to stare (at)", "8", "558"},
{"捨てる","すてる。", "to throw away", "8", "559"},
{"洗濯する","せんたくする。", "to do laundry", "8", "560"},
{"掃除する","そうじする。", "to clean", "8", "561"},
{"作る","つくる。", "to make", "8", "562"},
{"天気予報","てんきよほう。", "weather forecast", "8", "563"},
{"電話する","でんわする。", "to call", "8", "564"},
{"所","ところ。", "place", "8", "565"},
{"-","トマト。", "tomato", "8", "566"},
{"夏","なつ。", "summer", "8", "567"},
{"何か","なにか。", "something", "8", "568"},
{"-","～について。", "about . . . ; concerning . . .", "8", "569"},
{"-","パーティー。", "party", "8", "570"},
{"-","バーベキュー。", "barbecue", "8", "571"},
{"-","はし。", "chopsticks", "8", "572"},
{"始める","はじめる。", "to begin", "8", "573"},
{"冬","ふゆ。", "winter", "8", "574"},
{"下手","へた（な）。", "clumsy; poor at . . .", "8", "575"},
{"-","ホームステイ。", "homestay; living with a local family", "8", "576"},
{"毎週","まいしゅう。", "every week", "8", "577"},
{"-","まだ 。", "not . . . yet＋ negative", "8", "578"},
{"-","みんなで。", "all (of the people) together", "8", "579"},
{"持っていく","もっていく。", "to take (a thing)", "8", "580"},
{"有名","ゆうめい（な）。", "famous", "8", "581"},
{"料理する","りょうりする。", "to cook", "8", "582"},
{"切る","きる。", "to cut", "8", "583"},
{"-","いつも。", "always", "8", "584"},
{"-","アンケート。", "questionnaire", "8.2", "585"},
{"-","ストレス。", "stress", "8.2", "586"},
{"疲れている","つかれている。", "to be tired", "8.2", "587"},
{"次に","つぎに。", "secondly", "8.2", "588"},
{"去年","きょねん。", "last year", "9", "589"},
{"先月","せんげつ。", "last month", "9", "590"},
{"いい子","いいこ。", "good child", "9", "591"},
{"意地悪","いじわる（な）。", "mean-spirited", "9", "592"},
{"五つ","いつつ。", "five", "9", "593"},
{"色","いろ。", "color", "9", "594"},
{"運動する","うんどうする。", "to do physical exercises", "9", "595"},
{"踊る","おどる。", "to dance", "9", "596"},
{"お弁当","おべんとう。", "boxed lunch", "9", "597"},
{"覚える","おぼえる。", "to memorize", "9", "598"},
{"終わる","おわる。", "(something) ends", "9", "599"},
{"歌舞伎","かぶき。", "Kabuki; traditional Japanese theatrical art", "9", "600"},
{"-","ギター。", "guitar", "9", "601"},
{"薬","くすり。", "medicine", "9", "602"},
{"薬を飲む","くすりをのむ。", "to take medicine", "9", "603"},
{"九つ","ここのつ。", "nine", "9", "604"},
{"-","コンサート。", "concert", "9", "605"},
{"今度","こんど。", "near future", "9", "606"},
{"作文","さくぶん。", "essay; composition", "9", "607"},
{"寂しい","さびしい。", "lonely", "9", "608"},
{"散歩する","さんぽする。", "to take a walk", "9", "609"},
{"試験","しけん。", "exam", "9", "610"},
{"-","スキー。", "ski", "9", "611"},
{"是非","ぜひ。", "by all means", "9", "612"},
{"単語","たんご。", "word; vocabulary", "9", "613"},
{"十","とお。", "universal counter ten ", "9", "614"},
{"-","ところで。", "by the way", "9", "615"},
{"七つ","ななつ。", "universal counter seven", "9", "616"},
{"人気がある","にんきがある。", "to be popular", "9", "617"},
{"始まる","はじまる。", "(something) begins", "9", "618"},
{"-","ピアノ。", "piano", "9", "619"},
{"弾く","ひく。", "to play (a string instrument or piano)", "9", "620"},
{"一つ","ひとつ。", "universal counter one", "9", "621"},
{"二つ","ふたつ。", "universal counter two", "9", "622"},
{"弁当","べんとう。", "boxed lunch", "9", "623"},
{"三つ","みっつ。", "universal counter three", "9", "624"},
{"六つ","むっつ。", "universal counter six", "9", "625"},
{"-","もう。", "already", "9", "626"},
{"-","もらう。", "to get (from somebody)", "9", "627"},
{"八つ","やっつ。", "universal counter eight", "9", "628"},
{"四つ","よっつ。", "universal counter four", "9", "629"},
{"若い","わかい。", "young", "9", "630"},
{"病気","びょうき。", "illness; sickness", "9", "631"},
{"青い","あおい。", "blue adjective", "9", "632"},
{"赤い","あかい。", "red adjective", "9", "633"},
{"黒い","くろい。", "black adjective", "9", "634"},
{"白い","しろい。", "white adjective", "9", "635"},
{"出る","でる。", "to appear; to attend; to exit", "9", "636"},
{"-","ピザ。", "pizza", "9", "637"},
{"-","～から。", "from . . .", "9", "638"},
{"-","みんな。", "all", "9", "639"},
{"顔が青い","かおがあおい。", "to look pale", "9.1", "640"},
{"黄色い","きいろい。", "yellow", "9.1", "641"},
{"金色","きんいろ。", "gold", "9.1", "642"},
{"銀色","ぎんいろ。", "silver", "9.1", "643"},
{"金髪","きんぱつ。", "blonde hair", "9.1", "644"},
{"-","グリーン。", "green", "9.1", "645"},
{"-","グレー。", "gray", "9.1", "646"},
{"-","ゴールド。", "gold", "9.1", "647"},
{"-","シルバー。", "silver", "9.1", "648"},
{"白黒","しろくろ。", "black and white", "9.1", "649"},
{"茶色い","ちゃいろい。", "brown", "9.1", "650"},
{"灰色","はいいろ。", "gray", "9.1", "651"},
{"-","ピンク。", "pink", "9.1", "652"},
{"水色","みずいろ。", "light blue", "9.1", "653"},
{"紫","むらさき。", "purple", "9.1", "654"},
{"緑","みどり。", "green", "9.1", "655"},
{"午前中","ごぜんちゅう。", "in the morning", "9.2", "656"},
{"-","ごちそう。", "excellent food", "9.2", "657"},
{"昼","ひる。", "noon", "9.2", "658"},
{"秋","あき。", "fall", "10", "659"},
{"暖かい","あたたかい。", "warm", "10", "660"},
{"歩いて","あるいて。", "on foot", "10", "661"},
{"一番","いちばん。", "best", "10", "662"},
{"お金持ち","おかねもち。", "rich person", "10", "663"},
{"遅い","おそい。", "slow; late", "10", "664"},
{"-","～か～。", "or", "10", "665"},
{"-","かかる。", "to take (amount of time/money)", "10", "666"},
{"～か月","～かげつ。", "for . . . months", "10", "667"},
{"金持ち","かねもち。", "rich person", "10", "668"},
{"簡単","かんたん（な）。", "easy; simple", "10", "669"},
{"季節","きせつ。", "season", "10", "670"},
{"決める","きめる。", "to decide", "10", "671"},
{"牛乳","ぎゅうにゅう。", "milk", "10", "672"},
{"-","ケーキ。", "cake", "10", "673"},
{"～後","～ご。", "in . . . time; after . . .", "10", "674"},
{"-","このごろ。", "these days", "10", "675"},
{"-","サッカー。", "soccer", "10", "676"},
{"-","シャツ。", "shirt", "10", "677"},
{"～週間","～しゅうかん。", "for . . . weeks", "10", "678"},
{"新幹線","しんかんせん。", "Shinkansen; Bullet Train", "10", "679"},
{"-","すし。", "sushi", "10", "680"},
{"涼しい","すずしい。", "cool (weather)", "10", "681"},
{"生活","せいかつ。", "life; living", "10", "682"},
{"世界","せかい。", "world", "10", "683"},
{"地下鉄","ちかてつ。", "subway", "10", "684"},
{"冷たい","つめたい。", "cold (things/people)", "10", "685"},
{"-","～で。", "by (means of transportation); with (a tool)", "10", "686"},
{"手袋","てぶくろ。", "gloves", "10", "687"},
{"天ぷら","てんぷら。", "tempura", "10", "688"},
{"-","どうやって。", "how; by what means", "10", "689"},
{"床屋","とこや。", "barber’s", "10", "690"},
{"-","どちら。", "which", "10", "691"},
{"-","どっち。", "which", "10", "692"},
{"-","どのぐらい。", "how much; how long", "10", "693"},
{"泊まる","とまる。", "to stay (at a hotel, etc.)", "10","694"},
{"-","なる。", "to become", "10", "695"},
{"眠い","ねむい。", "sleepy", "10", "696"},
{"～年","～ねん。", ". . . years", "10", "697"},
{"早く/速く","はやく。", "(do something) early; fast", "10", "698"},
{"払う","はらう。", "to pay", "10", "699"},
{"春","はる。", "spring", "10", "700"},
{"-","パンツ。", "pants", "10", "701"},
{"美容院","びよういん。", "beauty parlor", "10", "702"},
{"便","びん。", "flight", "10", "703"},
{"船","ふね。", "ship; boat", "10", "704"},
{"野球","やきゅう。", "baseball", "10", "705"},
{"有名人","ゆうめいじん。", "celebrity", "10", "706"},
{"予約","よやく。", "reservation", "10", "707"},
{"来学期","らいがっき。", "next semester", "10", "708"},
{"旅行する","りょこうする。", "to travel", "10", "709"},
{"-","りんご。", "apple", "10", "710"},
{"練習する","れんしゅうする。", "to practice", "10", "711"},
{"-","クレジットカード。", "credit card", "10", "712"},
{"今年","ことし。", "this year", "10", "713"},
{"顔","かお。", "face", "10", "714"},
{"駅","えき。", "station", "10", "715"},
{"～行き","～いき。", "bound for . . .", "10.1", "716"},
{"一号車","いちごうしゃ。", "Car No. 1", "10.1", "717"},
{"一番後ろ","いちばんうしろ。", "last car; tail end", "10.1", "718"},
{"一番前","いちばんまえ。", "first car; front end", "10.1", "719"},
{"入口","いりぐち。", "entrance", "10.1", "720"},
{"往復","おうふく。", "round trip", "10.1", "721"},
{"改札","かいさつ。", "gate", "10.1", "722"},
{"回数券","かいすうけん。", "coupons", "10.1", "723"},
{"階段","かいだん。", "stairs", "10.1", "724"},
{"学割","がくわり。", "student discount", "10.1", "725"},
{"片道","かたみち。", "one way", "10.1", "726"},
{"切符売り場","きっぷうりば。", "ticket vending area", "10.1", "727"},
{"急行","きゅうこう。", "express", "10.1", "728"},
{"禁煙車","きんえんしゃ。", "nonsmoking car", "10.1", "729"},
{"指定席","していせき。", "reserved seat", "10.1", "730"},
{"次発","じはつ。", "departing second", "10.1", "731"},
{"自由席","じゆうせき。", "general admission seat", "10.1", "732"},
{"乗車券","じょうしゃけん。", "(boarding) ticket", "10.1", "733"},
{"先発","せんぱつ。", "departing first", "10.1", "734"},
{"次は～","つぎは～。", "next (stop), . . .", "10.1","735"},
{"定期券","ていきけん。", "commuter’s pass", "10.1", "736"},
{"出口","でぐち。", "exit", "10.1", "737"},
{"特急","とっきゅう。", "super express", "10.1", "738"},
{"乗り換え","のりかえ。", "transfer", "10.1", "739"},
{"売店","ばいてん。", "shop; stand", "10.1", "740"},
{"～番線","～ばんせん。", "track number . . .", "10.1", "741"},
{"普通","ふつう。", "local (train)", "10.1", "742"},
{"～方面","～ほうめん。", "serving . . . areas", "10.1", "743"},
{"-","ホーム。", "platform", "10.1", "744"},
{"-","いいこと。", "good deed", "10.2", "745"},
{"-","おじぞうさん。", "guardian deity of children", "10.2", "746"},
{"-","おもち。", "rice cake", "10.2", "747"},
{"-","かさ。", "bamboo hat", "10.2", "748"},
{"-","かぶせる。", "to put (a hat) on a person’s head", "10.2", "749"},
{"声","こえ。", "voice", "10.2", "750"},
{"-","じぞう。", "guardian deity of children", "10.2", "751"},
{"戸","と。", "door", "10.2", "752"},
{"年","とし。", "year", "10.2", "753"},
{"-","とる。", "to take off", "10.2", "754"},
{"昔々","むかしむかし。", "once upon a time", "10.2", "755"},
{"-","もち。", "rice cake", "10.2", "756"},
{"山道","やまみち。", "mountain road", "10.2", "757"},
{"-","うそをつく。", "to tell a lie", "11", "758"},
{"宇宙飛行士","うちゅうひこうし。", "astronaut", "11", "759"},
{"お菓子","おかし。", "snack; sweets", "11", "760"},
{"男の子","おとこのこ。", "boy", "11", "761"},
{"-","おなかがすく。", "to become hungry", "11", "762"},
{"お祭り","おまつり。", "festival", "11", "763"},
{"-","おもちゃ。", "toy", "11", "764"},
{"温泉","おんせん。", "spa; hot spring", "11", "765"},
{"女の子","おんなのこ。", "girl", "11", "766"},
{"外国","がいこく。", "foreign country", "11", "767"},
{"飼う","かう。", "to own (a pet)", "11", "768"},
{"菓子","かし。", "snack; sweets", "11", "769"},
{"歌手","かしゅ。", "singer", "11", "770"},
{"川","かわ。", "river", "11", "771"},
{"看護師","かんごし。", "nurse", "11", "772"},
{"-","キャンプ。", "camp", "11", "773"},
{"警察官","けいさつかん。", "police officer", "11", "774"},
{"-","けんかする。", "to have a fight; to quarrel", "11", "775"},
{"-","こちら。", "this person (polite)", "11", "776"},
{"今学期","こんがっき。", "this semester", "11", "777"},
{"作家","さっか。", "writer", "11", "778"},
{"-","サボる。", "to cut (classes)", "11", "779"},
{"-","ジャーナリスト。", "journalist", "11", "780"},
{"社長","しゃちょう。", "president of a company", "11", "781"},
{"授業","じゅぎょう。", "class", "11", "782"},
{"出身","しゅっしん。", "coming from", "11", "783"},
{"紹介する","しょうかいする。", "to introduce", "11", "784"},
{"消防士","しょうぼうし。", "firefighter", "11", "785"},
{"将来","しょうらい。", "future", "11", "786"},
{"女優","じょゆう。", "actress", "11", "787"},
{"神社","じんじゃ。", "shrine", "11", "788"},
{"-","ダイエットする。", "to go on a diet", "11", "789"},
{"大統領","だいとうりょう。", "president of a country", "11", "790"},
{"-","～だけ。", "just . . . ; only . . .", "11", "791"},
{"遅刻する","ちこくする。", "to be late (for an appointment)", "11", "792"},
{"疲れる","つかれる。", "to get tired", "11", "793"},
{"-","つり。", "fishing", "11", "794"},
{"～点","～てん。", ". . . points", "11", "795"},
{"-","ドライブ。", "drive", "11", "796"},
{"習う","ならう。", "to learn", "11", "797"},
{"登る","のぼる。", "to climb", "11", "798"},
{"俳優","はいゆう。", "actor; actress", "11", "799"},
{"働く","はたらく。", "to work", "11", "800"},
{"-","ビール。", "beer", "11", "801"},
{"久しぶり","ひさしぶり。", "it has been a long time", "11", "802"},
{"美術館","びじゅつかん。", "art museum", "11", "803"},
{"-","まあまあ。", "okay; so-so", "11", "804"},
{"祭り","おまつり。", "festival", "11", "805"},
{"漫画家","まんがか。", "cartoonist", "11", "806"},
{"湖","みずうみ。", "lake", "11", "807"},
{"-","もっと。", "more", "11", "808"},
{"野球選手","やきゅうせんしゅ。", "baseball player", "11", "809"},
{"-","やめる。", "to quit", "11", "810"},
{"夢","ゆめ。", "dream", "11", "811"},
{"留学する","りゅうがくする。", "to study abroad", "11", "812"},
{"-","ルームメート。", "roommate", "11", "813"},
{"お正月","おしょうがつ。", "New Year’s", "11", "814"},
{"正月","しょうがつ。", "New Year’s", "11", "815"},
{"山","やま。", "mountain", "11", "816"},
{"取る","とる。", "to take (a class); to get (a grade)", "11", "817"},
{"後","（～の）あと。", "after (an event)", "11", "818"},
{"-","そして。", "and then", "11", "819"},
{"-","ホストファミリー。", "host family", "11", "820"},
{"かたい言い方","かたいいいかた。", "bookish expression", "11.1", "821"},
{"-","かっこ。", "（　）(parenthesis)", "11.1", "822"},
{"～行目","～ぎょうめ。", "line number . . .", "11.1", "823"},
{"くだけた言い方","くだけたいいかた。", "colloquial expression", "11.1", "824"},
{"ていねいな言い方","ていねいないいかた。", "polite expression", "11.1", "825"},
{"-","ばつ。", "× (wrong)", "11.1", "826"},
{"発音","はつおん。", "pronunciation", "11.1", "827"},
{"標準語","ひょうじゅんご。", "standard Japanese", "11.1", "828"},
{"二人ずつ","ふたりずつ。", "two people each", "11.1", "829"},
{"-","～ページ。", "page number . . .", "11.1", "830"},
{"方言","ほうげん。", "dialect", "11.1", "831"},
{"-","ほかに。", "anything else", "11.1", "832"},
{"-","まる。", "○ (correct)", "11.1", "833"},
{"例","れい。", "example", "11.1", "834"},
{"練習","れんしゅう。", "exercise", "11.1", "835"},
{"質問","しつもん。", "question", "11.1", "836"},
{"答/答え","こたえ。", "answer", "11.1", "837"},
{"-","アウトドア。", "outdoor activities", "11.2", "838"},
{"明るい","あかるい。", "cheerful", "11.2", "839"},
{"お返事","おへんじ。", "reply", "11.2", "840"},
{"近所","きんじょ。", "neighborhood", "11.2", "841"},
{"-","バンド。", "band", "11.2", "842"},
{"返事","へんじ。", "reply", "11.2", "843"},
{"～募集","～ぼしゅう。", "looking for . . .", "11.2", "844"},
{"意味","いみ。", "meaning", "12", "845"},
{"甘い","あまい。", "sweet", "12", "846"},
{"歩く","あるく。", "to walk", "12", "847"},
{"痛い","いたい。", "hurt; painful", "12", "848"},
{"多い","おおい。", "there are many . . .", "12", "849"},
{"お大事に","おだいじに。", "Get well soon.", "12", "850"},
{"お手洗い","おてあらい。", "restroom", "12", "851"},
{"風邪","かぜ。", "cold", "12", "852"},
{"風邪をひく","かぜをひく。", "to catch a cold", "12", "853"},
{"彼","かれ。", "boyfriend", "12", "854"},
{"気温","きおん。", "temperature (weather)", "12", "855"},
{"興味がある","きょうみがある。", "to be interested (in)", "12", "856"},
{"緊張する","きんちょうする。", "to get nervous", "12", "857"},
{"曇り","くもり。", "cloudy weather", "12", "858"},
{"元気がない","げんきがない。", "don’t look well", "12", "859"},
{"試合","しあい。", "match; game", "12", "860"},
{"-","ジュース。", "juice", "12", "861"},
{"心配する","しんぱいする。", "to worry", "12", "862"},
{"素敵","すてき（な）。", "nice", "12", "863"},
{"成績","せいせき。", "grade (on a test, etc.)", "12","864"},
{"-","せき。", "cough", "12", "865"},
{"せきが出る","せきがでる。", "to cough", "12", "866"},
{"狭い","せまい。", "narrow; not spacious", "12", "867"},
{"多分","たぶん。", "probably; maybe", "12", "868"},
{"都合が悪い","つごうがわるい。", "inconvenient; to have a scheduling conflict", "12", "869"},
{"-","できるだけ。", "as much as possible", "12", "870"},
{"-","～でしょう。", "probably; . . ., right?", "12","871"},
{"～度","～ど。", ". . . degrees (temperature)", "12", "872"},
{"-","なくす。", "to lose", "12", "873"},
{"二三日","にさんにち。", "for two to three days", "12", "874"},
{"熱がある","ねつがある。", "to have a fever", "12", "875"},
{"-","～ので。", "because . . .", "12", "876"},
{"-","のど。", "throat", "12", "877"},
{"のどが渇く","のどがかわく。", "to become thirsty", "12", "878"},
{"初めて","はじめて。", "for the first time", "12", "879"},
{"花","はな。", "flower", "12", "880"},
{"晴れ","はれ。", "sunny weather", "12", "881"},
{"服","ふく。", "clothes", "12", "882"},
{"二日酔い","ふつかよい。", "hangover", "12", "883"},
{"-","プレゼント。", "present", "12", "884"},
{"-","ホームシック。", "homesickness", "12", "885"},
{"-","マイナス。", "minus", "12", "886"},
{"-","もうすぐ。", "very soon; in a few moments/days", "12", "887"},
{"物","もの。", "thing (concrete object)", "12", "888"},
{"用事","ようじ。", "business to take care of", "12", "889"},
{"別れる","わかれる。", "to break up; to separate", "12", "890"},
{"悪い","わるい。", "bad", "12", "891"},
{"足","あし。", "leg; foot", "12", "892"},
{"-","おなか。", "stomach", "12", "893"},
{"歯","は。", "tooth", "12", "894"},
{"雪","ゆき。", "snow", "12", "895"},
{"彼女","かのじょ。", "girlfriend", "12", "896"},
{"眼科","がんか。", "ophthalmologist", "12.1", "897"},
{"-","けが。", "injury", "12.1", "898"},
{"外科","げか。", "surgeon", "12.1", "899"},
{"抗生物質","こうせいぶっしつ。", "antibiotic", "12.1", "900"},
{"産婦人科","さんふじんか。", "obstetrician and gynecologist", "12.1", "901"},
{"歯科","しか。", "dentist", "12.1", "902"},
{"耳鼻科","じびか。", "otorhinolaryngologist; ENT doctor", "12.1", "903"},
{"手術","しゅじゅつ。", "operation", "12.1", "904"},
{"整形外科","せいけいげか。", "orthopedic surgeon", "12.1", "905"},
{"体温計","たいおんけい。", "thermometer", "12.1", "906"},
{"注射","ちゅうしゃ。", "injection", "12.1", "907"},
{"内科","ないか。", "physician", "12.1", "908"},
{"皮膚科","ひふか。", "dermatologist", "12.1", "909"},
{"-","レントゲン。", "X-ray", "12.1", "910"},
{"天の川","あまのがわ。", "the Milky Way", "12.2", "911"},
{"-","ある～。", "one . . .", "12.2", "912"},
{"一年に一度","いちねんにいちど。", "once a year", "12.2", "913"},
{"牛","うし。", "cow", "12.2", "914"},
{"-","かなう。", "to be realized", "12.2", "915"},
{"-","かわいそう（な）。", "pitiful", "12.2", "916"},
{"-","たんざく。", "strip of fancy paper", "12.2", "917"},
{"連れて帰る","つれてかえる。", "to bring (a person) back", "12.2", "918"},
{"天","てん。", "the heavens; the sky", "12.2", "919"},
{"-","～など。", "and so forth", "12.2", "920"},
{"願い","ねがい。", "wish", "12.2", "921"},
{"畑","はたけ。", "farm", "12.2", "922"},
{"はたを織る","はたをおる。", "to weave", "12.2", "923"},
{"人々","ひとびと。", "people", "12.2", "924"},
{"向こう","むこう。", "the other side; over there", "12.2", "925"},
{"娘","むすめ。", "daughter", "12.2", "926"},
{"文法","ぶんぽう。", "grammar", "13", "927"},
{"編む","あむ。", "to knit", "13", "928"},
{"一日","いちにち。", "one day", "13", "929"},
{"五日","いつか。", "five days", "13", "930"},
{"-","いらっしゃいます。", "(someone honorable) is present/home", "13", "931"},
{"-","ウエイター。", "waiter", "13", "932"},
{"-","うれしい。", "glad", "13", "933"},
{"お宅","おたく。", "(someone’s) house/home", "13", "934"},
{"～回","～かい。", ". . . times", "13", "935"},
{"外国語","がいこくご。", "foreign language", "13", "936"},
{"貸す","かす。", "to lend; to rent", "13", "937"},
{"楽器","がっき。", "musical instrument", "13", "938"},
{"辛い","からい。", "hot and spicy; salty", "13", "939"},
{"空手","からて。", "karate", "13", "940"},
{"-","カレー。", "curry", "13", "941"},
{"感動する","かんどうする。", "to be moved/touched (by . . .)", "13", "942"},
{"頑張る","がんばる。", "to do one’s best; to try hard", "13", "943"},
{"厳しい","きびしい。", "strict", "13", "944"},
{"-","～キロ。", ". . . kilometers; . . . kilograms", "13", "945"},
{"広告","こうこく。", "advertisement", "13", "946"},
{"紅茶","こうちゃ。", "tea (black tea)", "13", "947"},
{"九日","ここのか。", "nine days", "13", "948"},
{"言葉","ことば。", "language", "13", "949"},
{"-","ゴルフ。", "golf", "13", "950"},
{"実は","じつは。", "as a matter of fact, . . . ", "13","951"},
{"-","すごい。", "incredible; awesome", "13", "952"},
{"-","セーター。", "sweater", "13", "953"},
{"全部","ぜんぶ。", "all", "13", "954"},
{"象","ぞう。", "elephant", "13", "955"},
{"-","だめ（な）。", "no good", "13", "956"},
{"近い","ちかい。", "close; near", "13", "957"},
{"十日","とおか。", "ten days", "13", "958"},
{"～と申します","～ともうします。", "my name is . . . ", "13", "959"},
{"七日","なのか。", "seven days", "13", "960"},
{"-","バイオリン。", "violin", "13", "961"},
{"-","バイク。", "motorcycle", "13", "962"},
{"二日","ふつか。", "two days", "13", "963"},
{"物価","ぶっか。", "(consumer) prices", "13", "964"},
{"募集","ぼしゅう。", "recruitment", "13", "965"},
{"磨く","みがく。", "to brush (teeth); to polish", "13", "966"},
{"三日","みっか。", "three days", "13", "967"},
{"六日","むいか。", "six days", "13", "968"},
{"-","やくざ。", "yakuza; gangster", "13", "969"},
{"約束","やくそく。", "promise; appointment", "13", "970"},
{"約束を守る","やくそくをまもる。", "to keep a promise", "13", "971"},
{"八日","ようか。", "eight days", "13", "972"},
{"四日","よっか。", "four days", "13", "973"},
{"-","レポート。", "(term) paper", "13", "974"},
{"私","わたくし。", "I (formal)", "13", "975"},
{"悲しい","かなしい。", "sad", "13", "976"},
{"幸せ","しあわせ（な）。", "happy (lasting happiness)", "13", "977"},
{"大人","おとな。", "adult", "13", "978"},
{"泣く","なく。", "to cry", "13", "979"},
{"店","みせ。", "shop; store", "13", "980"},
{"-","いろいろ（な）。", "various; different kinds of", "13", "981"},
{"着物","きもの。", "kimono; Japanese traditional dress", "13", "982"},
{"暗証番号","あんしょうばんごう。", "personal identification number", "13.1", "983"},
{"お預け入れ","おあずけいれ。", "deposit", "13.1", "984"},
{"お引き出し","おひきだし。", "withdrawal", "13.1", "985"},
{"お振込","おふりこみ。", "bank transfer", "13.1", "986"},
{"-","キャッシュカード。", "bank card", "13.1", "987"},
{"金額","きんがく。", "amount", "13.1", "988"},
{"口座","こうざ。", "account", "13.1", "989"},
{"残高照会","ざんだかしょうかい。", "balance inquiry", "13.1", "990"},
{"通帳","つうちょう。", "passbook", "13.1", "991"},
{"通帳記入","つうちょうきにゅう。", "passbook update", "13.1", "992"},
{"手数料","てすうりょう。", "commission ", "13.1", "993"},
{"百円玉","ひゃくえんだま。", "100-yen coin", "13.1", "994"},
{"預金","よきん。", "savings", "13.1", "995"},
{"一生に一度","いっしょうにいちど。", "once in a lifetime", "13.2", "996"},
{"-","かめ。", "turtle", "13.2", "997"},
{"体にいい","からだにいい。", "good for health", "13.2", "998"},
{"-","すっぽん。", "snapping turtle; terrapin", "13.2", "999"},
{"特に","とくに。", "especially", "13.2", "1000"},
{"-","なべ。", "pot", "13.2", "1001"},
{"-","なんでも。", "anything; everything", "13.2", "1002"},
{"-","ニヤニヤする。", "to grin", "13.2", "1003"},
{"不安な","ふあんな。", "uneasy; worried", "13.2", "1004"},
{"-","めずらしい。", "rare", "13.2", "1005"},
{"-","もう～ない。", "not any longer", "13.2", "1006"},
{"込んでいる","こんでいる。", "to be crowded", "13.3", "1007"},
{"-","スーツケース。", "suitcase", "13.3", "1008"},
{"第一印象","だいいちいんしょう。", "the first impression", "13.3", "1009"},
{"満員電車","まんいんでんしゃ。", "jampacked train", "13.3", "1010"},
{"-","ラッシュ。", "the rush hour", "13.3", "1011"},
{"-","あきらめる。", "to give up", "14", "1012"},
{"-","あげる。", "to give (to others)", "14", "1013"},
{"兄","あに。", "(my) older brother", "14", "1014"},
{"大家さん","おおやさん。", "landlord; landlady", "14", "1015"},
{"お返し","おかえし。", "return (as a token gratitude)", "14", "1016"},
{"奥さん","おくさん。", "(your/his) wife", "14", "1017"},
{"送る","おくる。", "to send", "14", "1018"},
{"-","おじさん。", "uncle; middle-aged man", "14", "1019"},
{"-","おばさん。", "aunt; middle-aged woman", "14", "1020"},
{"-","グラス。", "tumbler; glass", "14", "1021"},
{"-","クリスマス。", "Christmas", "14", "1022"},
{"-","くれる。", "to give (me)", "14", "1023"},
{"～君","～くん。", "Mr./Ms. . . . (casual)", "14", "1024"},
{"-","けち（な）。", "stingy; cheap", "14", "1025"},
{"ご主人","ごしゅじん。", "(your/her) husband", "14", "1026"},
{"-","こんな～。", ". . . like this; this kind of . . .", "14", "1027"},
{"皿","さら。", "plate; dish", "14", "1028"},
{"時間","じかん。", "time", "14", "1029"},
{"相談する","そうだんする。", "to consult", "14", "1030"},
{"-","～たち。", "[makes a noun plural]", "14", "1031"},
{"-","チケット。", "ticket", "14", "1032"},
{"-","ちょうど。", "exactly", "14", "1033"},
{"-","チョコレート。", "chocolate", "14", "1034"},
{"-","できる。", "to come into existence; to be made", "14", "1035"},
{"-","どうしたらいい。", "what should one do", "14", "1036"},
{"-","トレーナー。", "sweat shirt", "14", "1037"},
{"似合う","にあう。", "to look good (on somebody)", "14", "1038"},
{"-","ぬいぐるみ。", "stuffed animal (e.g., teddy bear)", "14","1039"},
{"-","ネクタイ。", "necktie", "14", "1040"},
{"-","バレンタインデー。", "St. Valentine’s Day", "14", "1041"},
{"-","ビデオカメラ。", "camcorder", "14", "1042"},
{"夫婦","ふうふ。", "married couple; husband and wife", "14", "1043"},
{"-","プロポーズする。", "to propose marriage", "14", "1044"},
{"欲しい","ほしい。", "to want", "14", "1045"},
{"-","ホワイトデー。", "White Day (yet another gift-giving day)", "14", "1046"},
{"-","マフラー。", "winter scarf", "14", "1047"},
{"漫画","まんが。", "comic book", "14", "1048"},
{"-","マンション。", "multistory apartment building; condominium", "14", "1049"},
{"-","みかん。", "mandarin orange", "14", "1050"},
{"指輪","ゆびわ。", "ring", "14", "1051"},
{"-","よく。", "well", "14", "1052"},
{"-","ラジオ。", "radio", "14", "1053"},
{"両親","りょうしん。", "parents", "14", "1054"},
{"履歴書","りれきしょ。", "resume", "14", "1055"},
{"～個","～こ。", "[counter for smaller items]", "14", "1056"},
{"～冊","～さつ。", "[counter for bound volumes]", "14", "1057"},
{"～台","～だい。", "[counter for equipment]", "14", "1058"},
{"～匹","～ひき。", "[counter for smaller aminals]", "14", "1059"},
{"～本","～ほん。", "[counter for long objects]", "14", "1060"},
{"私たち","わたしたち。", "we", "14", "1061"},
{"同じ","おなじ。", "same", "14", "1062"},
{"皆さん","みなさん。", "everyone; all of you", "14", "1063"},
{"愛す","あいす。", "to love", "14.2", "1064"},
{"-","アドバイス。", "advice", "14.2", "1065"},
{"急に","きゅうに。", "suddenly", "14.2", "1066"},
{"時代","じだい。", "age; era", "14.2", "1067"},
{"父親","ちちおや。", "father", "14.2", "1068"},
{"年上","としうえ。", "being older", "14.2", "1069"},
{"～年間","～ねんかん。", "for . . . years", "14.2", "1070"},
{"場合","ばあい。", "case", "14.2", "1071"},
{"締め切り","しめきり。", "deadline", "15", "1072"},
{"～番","～ばん。", "number . . .", "15", "1073"},
{"一日中","いちにちじゅう。", "all day long", "15", "1074"},
{"-","インターネット。", "Internet", "15", "1075"},
{"絵","え。", "painting; picture; drawing", "15", "1076"},
{"映画館","えいがかん。", "movie theater", "15", "1077"},
{"下ろす","おろす。", "to withdraw (money)", "15", "1078"},
{"外国人","がいこくじん。", "foreigner", "15", "1079"},
{"描く","かく。", "to draw; to paint", "15", "1080"},
{"家具","かぐ。", "furniture", "15", "1081"},
{"観光する","かんこうする。", "to do sightseeing", "15", "1082"},
{"気をつける","きをつける。", "to be cautious/careful", "15", "1083"},
{"-","クラブ。", "night club", "15", "1084"},
{"結婚式","けっこんしき。", "wedding", "15", "1085"},
{"-","～けど。", ". . ., but; . . ., so","15","1086"},
{"最近","さいきん。", "recently", "15", "1087"},
{"探す","さがす。", "to look for", "15", "1088"},
{"誘う","さそう。", "to invite", "15", "1089"},
{"地震","じしん。", "earthquake", "15", "1090"},
{"-","ジャケット。", "jacket", "15", "1091"},
{"-","しゃべる。", "to chat", "15", "1092"},
{"習慣","しゅうかん。", "custom", "15", "1093"},
{"調べる","しらべる。", "to look into (a matter)", "15", "1094"},
{"-","する。", "to decide on (an item)", "15", "1095"},
{"税金","ぜいきん。", "tax", "15", "1096"},
{"卒業式","そつぎょうしき。", "graduation ceremony", "15", "1097"},
{"卒業する","そつぎょうする。", "to graduate (from . . .)", "15", "1098"},
{"-","そば。", "soba; Japanese buckwheat noodle", "15", "1099"},
{"地図","ちず。", "map", "15", "1100"},
{"電池","でんち。", "battery", "15", "1101"},
{"庭","にわ。", "garden", "15", "1102"},
{"発表","はっぴょう。", "presentation", "15", "1103"},
{"番組","ばんぐみ。", "broadcast program", "15", "1104"},
{"広い","ひろい。", "spacious; wide", "15", "1105"},
{"-","プール。", "swimming pool", "15", "1106"},
{"-","ペット。", "pet", "15", "1107"},
{"保険に入る","ほけんにはいる。", "to buy insurance", "15", "1108"},
{"見える","みえる。", "to be visible", "15", "1109"},
{"～目","～め。", "-th", "15", "1110"},
{"もう一度","もういちど。", "one more time", "15", "1111"},
{"予定","よてい。", "schedule; plan", "15", "1112"},
{"予約する","よやくする。", "to reserve", "15", "1113"},
{"旅館","りょかん。", "Japanese inn", "15", "1114"},
{"割引券","わりびきけん。", "discount coupon", "15", "1115"},
{"保険","ほけん。", "insurance", "15", "1116"},
{"売る","うる。", "to sell", "15", "1117"},
{"経験","けいけん。", "experience", "15", "1118"},
{"着く","つく。", "to arrive", "15", "1119"},
{"付き合う","つきあう。", "to date (someone); to keep company", "15", "1120"},
{"一泊二食付","いっぱくにしょくつき。", "one night with two meals", "15.1", "1121"},
{"喫煙ルーム","きつえんルーム。", "smoking room", "15.1", "1122"},
{"禁煙ルーム","きんえんルーム。", "nonsmoking room", "15.1", "1123"},
{"食事付","しょくじつき。", "with meals", "15.1", "1124"},
{"-","シングル。", "single room", "15.1", "1125"},
{"-","ダブル。", "double room", "15.1", "1126"},
{"-","チェックアウト（する）。", "checking out", "15.1", "1127"},
{"-","チェックイン（する）。", "checking in", "15.1", "1128"},
{"-","ツイン。", "twin room", "15.1", "1129"},
{"～付","～つき。", "with . . .", "15.1", "1130"},
{"～泊","～はく。", ". . . nights", "15.1", "1131"},
{"-","フロント。", "receptionist; front desk", "15.1", "1132"},
{"～名","～めい。", ". . . person(s)", "15.1", "1133"},
{"一年中","いちねんじゅう。", "all year", "15.2", "1134"},
{"落とされる","おとされる。", "to be dropped", "15.2", "1135"},
{"-","くじら。", "whale", "15.2", "1136"},
{"景色","けしき。", "scenery", "15.2", "1137"},
{"原爆","げんばく。", "atomic bomb", "15.2", "1138"},
{"紅葉","こうよう。", "red leaves; autumn tints", "15.2", "1139"},
{"鹿","しか。", "deer", "15.2", "1140"},
{"自然","しぜん。", "nature", "15.2", "1141"},
{"島","しま。", "island", "15.2", "1142"},
{"戦争","せんそう。", "war", "15.2", "1143"},
{"竹","たけ。", "bamboo", "15.2", "1144"},
{"建物","たてもの。", "building", "15.2", "1145"},
{"楽しむ","たのしむ。", "to enjoy", "15.2", "1146"},
{"地下","ちか。", "underground", "15.2", "1147"},
{"通る","とおる。", "to pass; to go through", "15.2", "1148"},
{"トロッコ列車","トロッコれっしゃ。", "small train usually for tourists", "15.2", "1149"},
{"残す","のこす。", "to leave; to preserve", "15.2", "1150"},
{"広場","ひろば。", "square; open space", "15.2", "1151"},
{"平和","へいわ。", "peace", "15.2", "1152"},
{"平和記念資料館","へいわきねんしりょうかん。", "Peace Memorial Museum", "15.2", "1153"},
{"-","ホームレス。", "homeless", "15.2", "1154"},
{"-","アイロンをかける。", "to iron (clothes)", "16", "1155"},
{"朝寝坊する","あさねぼうする。", "to oversleep", "16", "1156"},
{"集める","あつめる。", "to collect", "16", "1157"},
{"入れる","いれる。", "to put (something) in", "16", "1158"},
{"-","ええと。", "well . . . ; let me see . . .", "16", "1159"},
{"駅員（さん）","えきいん（さん）。", "station attendant", "16", "1160"},
{"大きさ","おおきさ。", "size", "16", "1161"},
{"起こす","おこす。", "to wake (someone) up", "16", "1162"},
{"-","おごる。", "to treat (someone) to a meal", "16", "1163"},
{"落ち込む","おちこむ。", "to get depressed", "16", "1164"},
{"親","おや。", "parent", "16", "1165"},
{"汚い","きたない。", "dirty", "16", "1166"},
{"期末試験","きまつしけん。", "final examination", "16", "1167"},
{"今日中に","きょうじゅうに。", "by the end of today", "16", "1168"},
{"研究","けんきゅう。", "research", "16", "1169"},
{"この間","このあいだ。", "the other day", "16", "1170"},
{"-","このぐらい。", "about this much", "16", "1171"},
{"困る","こまる。", "to have difficulty", "16", "1172"},
{"-","ごみ。", "garbage", "16", "1173"},
{"-","ごめん。", "I’m sorry. (casual)", "16", "1174"},
{"砂糖","さとう。", "sugar", "16", "1175"},
{"失礼します","しつれいします。", "Excuse me.; Sorry to interrupt you.", "16", "1176"},
{"自分で","じぶんで。", "(do something) by oneself", "16", "1177"},
{"授業中に","じゅぎょうちゅうに。", "in class; during the class", "16", "1178"},
{"奨学金","しょうがくきん。", "scholarship", "16", "1179"},
{"親せき","しんせき。", "relatives", "16", "1180"},
{"推薦状","すいせんじょう。", "letter of recommendation", "16", "1181"},
{"説明する","せつめいする。", "to explain", "16", "1182"},
{"大学院","だいがくいん。", "graduate school", "16", "1183"},
{"台風","たいふう。", "typhoon", "16", "1184"},
{"出す","だす。", "to take (something) out; to hand in (something)", "16", "1185"},
{"連れていく","つれていく。", "to take (someone) to (a place)", "16", "1186"},
{"直す","なおす。", "to correct; to fix", "16", "1187"},
{"乗り遅れる","のりおくれる。", "to miss (a train, bus, etc.)","16","1188"},
{"日","ひ。", "day", "16", "1189"},
{"-","ファイル。", "file; portfolio", "16", "1190"},
{"-","ほかの。", "other", "16", "1191"},
{"見せる","みせる。", "to show", "16", "1192"},
{"道","みち。", "way; road; directions", "16", "1193"},
{"道に迷う","みちにまよう。", "to become lost; to lose one’s way", "16", "1194"},
{"見つかる","みつかる。", "to be found", "16", "1195"},
{"迎えに行く","むかえにいく。", "to go to pick up", "16", "1196"},
{"迎えに来る","むかえにくる。", "to come to pick up", "16", "1197"},
{"目覚まし時計","めざましどけい。", "alarm clock", "16", "1198"},
{"訳す","やくす。", "to translate", "16", "1199"},
{"笑う","わらう。", "to laugh", "16", "1200"},
{"-","これから。", "from now on", "16", "1201"},
{"案内する","あんないする。", "to show (someone) around", "16", "1202"},
{"～以外","～いがい。", "other than . . .", "16.2", "1203"},
{"写す","うつす。", "to copy", "16.2", "1204"},
{"教室","きょうしつ。", "classroom", "16.2", "1205"},
{"小学生","しょうがくせい。", "elementary school students", "16.2", "1206"},
{"-","すると。", ". . . Then, . . .", "16.2","1207"},
{"空","そら。", "sky ", "16.2", "1208"},
{"続く","つづく。", "to continue", "16.2", "1209"},
{"道具","どうぐ。", "tool", "16.2", "1210"},
{"-","どこでも。", "anywhere", "16.2", "1211"},
{"飛ぶ","とぶ。", "to fly", "16.2", "1212"},
{"-","～のようなもの。", "something like . . .", "16.2", "1213"},
{"-","ポケット。", "pocket", "16.2", "1214"},
{"-","また。", "in addition", "16.2", "1215"},
{"味方","みかた。", "person on one’s side", "16.2", "1216"},
{"未来","みらい。", "future", "16.2", "1217"},
{"弱い","よわい。", "weak", "16.2", "1218"},
{"-","ロボット。", "robot", "16.2", "1219"},
{"例えば","たとえば。", "for example", "17", "1220"},
{"危ない","あぶない。", "dangerous", "17", "1221"},
{"-","いれる。", "to make tea, coffee, etc.","17","1222"},
{"-","うらやましい。", "envious", "17", "1223"},
{"選ぶ","えらぶ。", "to choose; to select", "17", "1224"},
{"お祈りする","おいのりする。", "to pray", "17", "1225"},
{"お客さん","おきゃくさん。", "guest; visitor; client; customer", "17", "1226"},
{"-","おめでとうございます。", "Congratulations!", "17", "1227"},
{"お湯","おゆ。", "hot water", "17", "1228"},
{"お湯を沸かす","おゆをわかす。", "to boil water", "17", "1229"},
{"-","かぎ。", "lock; key", "17", "1230"},
{"-","かぎをかける。", "to lock", "17", "1231"},
{"火事","かじ。", "fire", "17", "1232"},
{"-","かな。", "I wonder . . . (casual)", "17", "1233"},
{"紙","かみ。", "paper", "17", "1234"},
{"髪をとかす","かみをとかす。", "to comb one’s hair", "17", "1235"},
{"給料","きゅうりょう。", "salary", "17", "1236"},
{"化粧する","けしょうする。", "to put makeup on", "17", "1237"},
{"-","コンタクト。", "contact lenses", "17", "1238"},
{"最低","さいてい。", "the lowest; the worst", "17", "1239"},
{"-","サラリーマン。", "salaryman; company employee", "17", "1240"},
{"就職する","しゅうしょくする。", "to get a full-time job (at . . .)", "17", "1241"},
{"首相","しゅしょう。", "prime minister", "17", "1242"},
{"-","ショッピングモール。", "shopping mall", "17", "1243"},
{"-","ずいぶん。", "very", "17", "1244"},
{"少ない","すくない。", "a little; a few", "17", "1245"},
{"-","スプーン。", "spoon", "17", "1246"},
{"-","する。", "to wear small items (necktie, watch, etc.)","17","1247"},
{"-","そうか。", "I see. (casual)", "17", "1248"},
{"-","それに。", "moreover, . . .", "17","1249"},
{"宝くじ","たからくじ。", "lottery", "17", "1250"},
{"宝くじに当たる","たからくじにあたる。", "to win a lottery", "17", "1251"},
{"足りる","たりる。", "to be sufficient; to be enough", "17", "1252"},
{"違い","ちがい。", "difference", "17", "1253"},
{"強い","つよい。", "strong", "17", "1254"},
{"動物園","どうぶつえん。", "zoo", "17", "1255"},
{"慣れる","なれる。", "to get used to . . .", "17", "1256"},
{"～に比べて","～にくらべて。", "compared with . . .", "17", "1257"},
{"-","ニュース。", "news", "17", "1258"},
{"-","～によると。", "according to . . .", "17", "1259"},
{"脱ぐ","ぬぐ。", "to take off (clothes)", "17", "1260"},
{"-","パンダ。", "panda", "17", "1261"},
{"-","ヒーター。", "heater", "17", "1262"},
{"-","ひげ。", "beard", "17", "1263"},
{"-","ひげをそる。", "to shave one’s beard", "17", "1264"},
{"-","ブーツ。", "boots", "17", "1265"},
{"前","まえ。", "before . . .", "17", "1266"},
{"離婚する","りこんする。", "to get a divorce", "17", "1267"},
{"旅行会社","りょこうがいしゃ。", "travel agency", "17", "1268"},
{"自分","じぶん。", "oneself", "17", "1269"},
{"男","おとこ。", "man", "17", "1270"},
{"女","おんな。", "woman", "17", "1271"},
{"-","やっぱり。", "after all", "17", "1272"},
{"込む","こむ。", "to get crowded", "17", "1273"},
{"生まれる","うまれる。", "to be born", "17", "1274"},
{"秘密","ひみつ。", "secret", "17", "1275"},
{"残業","ざんぎょう。", "overtime work", "17", "1276"},
{"寮","りょう。", "dormitory", "17", "1277"},
{"-","カット。", "cut", "17.1", "1278"},
{"髪形","かみがた。", "hair style", "17.1", "1279"},
{"刈る","かる。", "to crop", "17.1", "1280"},
{"-","セット。", "set", "17.1", "1281"},
{"-","そめる。", "to dye", "17.1", "1282"},
{"-","そる。", "to shave", "17.1", "1283"},
{"-","そろえる。", "to make hair even; to trim", "17.1", "1284"},
{"-","パーマ。", "permanent", "17.1", "1285"},
{"-","パーマをかける。", "to have one’s hair permed", "17.1", "1286"},
{"-","ブロー。", "blow-dry", "17.1", "1287"},
{"-","もみあげ。", "sideburns", "17.1", "1288"},
{"影響を受ける","えいきょうをうける。", "to be affected", "17.2", "1289"},
{"主に","おもに。", "mainly", "17.2", "1290"},
{"数える","かぞえる。", "to count", "17.2", "1291"},
{"活動","かつどう。", "activities", "17.2", "1292"},
{"完成する","かんせいする。", "to be completed", "17.2", "1293"},
{"雲","くも。", "cloud", "17.2", "1294"},
{"芸術","げいじゅつ。", "art", "17.2", "1295"},
{"作品","さくひん。", "artistic piece", "17.2", "1296"},
{"詩","し。", "poem", "17.2", "1297"},
{"-","しかし。", "however", "17.2", "1298"},
{"銃で撃たれる","じゅうでうたれる。", "to be shot", "17.2", "1299"},
{"主夫","しゅふ。", "house husband", "17.2", "1300"},
{"1960-年代","せんきゅうひゃくろくじゅうねんだい。", "1960’s", "17.2", "1301"},
{"その後","そのご。", "after that", "17.2", "1302"},
{"大ヒット","だいヒット。", "big hit", "17.2", "1303"},
{"天井","てんじょう。", "ceiling", "17.2", "1304"},
{"展覧会","てんらんかい。", "art exhibition", "17.2", "1305"},
{"名前をつける","なまえをつける。", "to name", "17.2", "1306"},
{"-","～のための。", "for the sake of . . .", "17.2", "1307"},
{"俳句","はいく。", "haiku (Japanese poetry)", "17.2", "1308"},
{"-","はしご。", "ladders", "17.2", "1309"},
{"発表する","はっぴょうする。", "to make public; to publish", "17.2", "1310"},
{"分野","ぶんや。", "field; realm", "17.2", "1311"},
{"虫めがね","むしめがね。", "magnifying glass", "17.2", "1312"},
{"文字","もじ。", "letter; character", "17.2", "1313"},
{"-","シャンプー。", "shampoo", "18", "1314"},
{"明るい","あかるい。", "bright", "18", "1315"},
{"開く","あく。", "(something) opens", "18", "1316"},
{"後","あと。", "the rest", "18", "1317"},
{"謝る","あやまる。", "to apologize", "18", "1318"},
{"今すぐ","いますぐ。", "right away", "18", "1319"},
{"-","エアコン。", "air conditioner", "18", "1320"},
{"-","おかげで。", "thanks to . . .", "18", "1321"},
{"お先に失礼します","おさきにしつれいします。", "See you. (lit., I’m leaving ahead of you.)", "18","1322"},
{"押す","おす。", "to press; to push", "18", "1323"},
{"落ちる","おちる。", "(something) drops", "18", "1324"},
{"お疲れ様（でした）","おつかれさま（でした）。", "You must be tired after working so hard. (ritualistic expression)", "18", "1325"},
{"落とす","おとす。", "to drop (something)", "18", "1326"},
{"お湯が沸く","おゆがわく。", "water boils", "18", "1327"},
{"片付ける","かたづける。", "to tidy up", "18", "1328"},
{"消える","きえる。", "(something) goes off", "18", "1329"},
{"-","クッション。", "cushion", "18", "1330"},
{"暗い","くらい。", "dark", "18", "1331"},
{"転ぶ","ころぶ。", "to fall down", "18", "1332"},
{"壊す","こわす。", "to break (something)", "18", "1333"},
{"壊れる","こわれる。", "(something) breaks", "18", "1334"},
{"咲く","さく。", "to bloom", "18", "1335"},
{"閉まる","しまる。", "(something) closes", "18", "1336"},
{"しょう油","しょうゆ。", "soy sauce", "18", "1337"},
{"-","スイッチ。", "switch", "18", "1338"},
{"-","スープ。", "soup", "18", "1339"},
{"-","スカート。", "skirt", "18", "1340"},
{"外","そと。", "outside", "18", "1341"},
{"-","ソファ。", "sofa", "18", "1342"},
{"-","タオル。", "towel", "18", "1343"},
{"助かる","たすかる。", "to be saved; to be helped", "18", "1344"},
{"頼む","たのむ。", "to ask (a favor)", "18", "1345"},
{"-","～（ん）だろう。", "short form of en dahshow", "18", "1346"},
{"注文する","ちゅうもんする。", "to place an order", "18", "1347"},
{"-","つく。", "(something) turns on", "18", "1348"},
{"-","どうしよう。", "What should I/we do?", "18", "1349"},
{"恥ずかしい","はずかしい。", "embarrassing; to feel embarrassed", "18", "1350"},
{"-","バナナ。", "banana", "18", "1351"},
{"-","ポップコーン。", "popcorn", "18", "1352"},
{"虫","むし。", "insect", "18", "1353"},
{"家賃","やちん。", "rent", "18", "1354"},
{"夕方","ゆうがた。", "evening", "18", "1355"},
{"汚す","よごす。", "to make dirty", "18", "1356"},
{"汚れる","よごれる。", "to become dirty", "18", "1357"},
{"留守番電話","るすばんでんわ。", "answering machine", "18", "1358"},
{"冷蔵庫","れいぞうこ。", "refrigerator", "18", "1359"},
{"-","ろうそく。", "candle", "18", "1360"},
{"-","カーテン。", "curtain", "18", "1361"},
{"-","～までに。", "by (time/date)", "18", "1362"},
{"気分が悪い","きぶんがわるい。", "to feel sick", "18", "1363"},
{"考える","かんがえる。", "to think (about); to consider", "18", "1364"},
{"本当に","ほんとうに。", "really", "18", "1365"},
{"-","まず。", "first of all", "18", "1366"},
{"日記","にっき。", "diary", "18", "1367"},
{"～以上","～いじょう。", ". . . or more", "18.2", "1368"},
{"時給","じきゅう。", "an hourly wage", "18.2", "1369"},
{"女子学生","じょしがくせい。", "female student", "18.2", "1370"},
{"生活のゆとり","せいかつのゆとり。", "extra money to spare for the cost of living", "18.2", "1371"},
{"生活費","せいかつひ。", "the cost of living", "18.2", "1372"},
{"男子学生","だんしがくせい。", "male student", "18.2", "1373"},
{"貯金","ちょきん。", "savings", "18.2", "1374"},
{"目的","もくてき。", "object; purpose", "18.2", "1375"},
{"洋服","ようふく。", "clothes", "18.2", "1376"},
{"家庭教師","かていきょうし。", "tutor", "18.3", "1377"},
{"親しい","したしい。", "close; intimate", "18.3", "1378"},
{"食費","しょくひ。", "food cost", "18.3", "1379"},
{"～代","～だい。", "charge; fee", "18.3", "1380"},
{"力仕事","ちからしごと。", "physical labor such as construction", "18.3", "1381"},
{"電気代","でんきだい。", "charge for electricity", "18.3", "1382"},
{"初めは","はじめは。", "at first", "18.3", "1383"},
{"引っ越し","ひっこし。", "moving", "18.3", "1384"},
{"毎月","まいつき。", "every month", "18.3", "1385"},
{"-","ワンルームマンション。", "one-room apartment; a studio", "18.3", "1386"},
{"-","いらっしゃる。", "honorific expression for come, go, and thing exists いく くる いる。", "19", "1387"},
{"遠慮する","えんりょする。", "to hold back for the time being; to refrain from", "19", "1388"},
{"奥様","おくさま。", "(your/his) wife (polite)", "19", "1389"},
{"送る","おくる。", "to walk/drive (someone)", "19", "1390"},
{"遅れる","おくれる。", "to become late", "19", "1391"},
{"お子さん","おこさん。", "(your/their) child (polite)", "19", "1392"},
{"-","おっしゃる。", "honorific expression for say いう", "19", "1393"},
{"お休みになる","おやすみになる。", "honorific expression for sleep ねる", "19", "1394"},
{"お礼","おれい。", "expression of gratitude", "19", "1395"},
{"-","かける。", "to sit down", "19", "1396"},
{"決まる","きまる。", "to be decided", "19", "1397"},
{"下さる","くださる。", "honorific expression for give to me くれる", "19", "1398"},
{"敬語","けいご。", "honorific language", "19", "1399"},
{"-","ごちそうする。", "to treat/invite (someone) to a meal", "19", "1400"},
{"-","こちら。", "this way (polite)", "19", "1401"},
{"ご覧になる","ごらんになる。", "honorific expression for see みる", "19", "1402"},
{"種類","しゅるい。", "a kind; a sort", "19", "1403"},
{"招待する","しょうたいする。", "to invite someone (to an event/a place)", "19", "1404"},
{"知り合う","しりあう。", "to get acquainted with", "19", "1405"},
{"性格","せいかく。", "personality", "19", "1406"},
{"-","それで。", "then; therefore", "19", "1407"},
{"中学生","ちゅうがくせい。", "junior high school student", "19", "1408"},
{"-","～ていらっしゃる。", "honorific expression for (tay eiru) ～ている", "19", "1409"},
{"-","どちら。", "where (polite)", "19", "1410"},
{"仲がいい","なかがいい。", "be on good/close terms; to get along well", "19", "1411"},
{"-","なさる。", "honorific expression for do する", "19", "1412"},
{"-","なぜ。", "why", "19", "1413"},
{"怠け者","なまけもの。", "lazy person", "19", "1414"},
{"恥ずかしがり屋","はずかしがりや。", "shy person", "19", "1415"},
{"話","はなし。", "chat; talk", "19", "1416"},
{"晴れる","はれる。", "to become sunny", "19", "1417"},
{"引っ越す","ひっこす。", "to move (to another place to live)", "19", "1418"},
{"部長","ぶちょう。", "department manager", "19", "1419"},
{"本当は","ほんとうは。", "in fact; originally", "19", "1420"},
{"毎朝","まいあさ。", "every morning", "19", "1421"},
{"-","まだ。", "still", "19", "1422"},
{"間違い","まちがい。", "mistake", "19", "1423"},
{"～名様","～めいさま。", "party of . . . people", "19", "1424"},
{"召し上がる","めしあがる。", "honorific expression for eat and drink たべるのむ", "19", "1425"},
{"もてる","もてる。", "to be popular (in terms of romantic interest)", "19", "1426"},
{"-","ようこそ。", "Welcome.", "19", "1427"},
{"呼ぶ","よぶ。", "to call (one’s name); to invite", "19", "1428"},
{"寄る","よる。", "to stop by", "19", "1429"},
{"よろしくお伝えください","よろしくおつたえください。", "Please give my best regards (to . . .)", "19", "1430"},
{"-","おととい。", "the day before yesterday", "19", "1431"},
{"文化","ぶんか。", "culture", "19", "1432"},
{"怒る","おこる。", "to get angry", "19", "1433"},
{"-","まじめ（な）。", "serious; sober; diligent", "19", "1434"},
{"出張","しゅっちょう。", "business trip", "19", "1435"},
{"悩み","なやみ。", "worry", "19", "1436"},
{"注意する","ちゅういする。", "to watch out; to give warning", "19", "1437"},
{"話をする","はなしをする。", "to have a talk", "19", "1438"},
{"-","いかが。", "how (polite expression of どう)", "19.2", "1439"},
{"思い出す","おもいだす。", "to recall", "19.2", "1440"},
{"-","しょうぎ。", "Japanese chess", "19.2", "1441"},
{"-","それでは。", "well then", "19.2", "1442"},
{"大切にする","たいせつにする。", "to take good care of", "19.2", "1443"},
{"-","たいへん。", "greatly", "19.2", "1444"},
{"-","たつ。", "(time) pass", "19.2", "1445"},
{"～中","～ちゅう。", "while . . . ", "19.2", "1446"},
{"-","なつかしい。", "to miss; to long for", "19.2", "1447"},
{"みな様","みなさま。", "everyone (polite expression of みなさん)", "19.2", "1448"},
{"国際","こくさい。", "international", "19.3", "1449"},
{"電気工学","でんきこうがく。", "electric engineering", "19.3", "1450"},
{"どうぞよろしくお願いします","どうぞよろしくおねがいします。", "Thank you in advance.", "19.3", "1451"},
{"突然","とつぜん。", "suddenly", "19.3", "1452"},
{"～の紹介で","～のしょうかいで。", "through the introduction of", "19.3", "1453"},
{"-","～のために。", "for . . . ", "19.3", "1454"},
{"申し込み","もうしこみ。", "application", "19.3", "1455"},
{"-","もし～たら。", "if . . . ", "19.3", "1456"},
{"友人","ゆうじん。", "friend", "19.3", "1457"},
{"-","あちら。", "that way (place)", "20", "1458"},
{"-","アニメ。", "animation", "20", "1459"},
{"致す","いたす。", "extra-modest expression for do する", "20", "1460"},
{"頂く","いただく。", "extra-modest expression for eat and drink たべる, のむ", "20","1461"},
{"頂く","いただく。", "humble expression for receive もらう", "20", "1462"},
{"伺う","うかがう。", "to humbly visit; to humbly ask", "20", "1463"},
{"宇宙人","うちゅうじん。", "space alien", "20", "1464"},
{"音","おと。", "sound", "20", "1465"},
{"おにぎり","おにぎり。", "rice ball", "20", "1466"},
{"重い","おもい。", "heavy; serious (illness)", "20", "1467"},
{"-","おや？。", "Oh!", "20", "1468"},
{"-","おる。", "extra-modest expression for person exists いる", "20", "1469"},
{"～階","～かい。", ". . . th floor", "20", "1470"},
{"係の者","かかりのもの。", "our person in charge", "20", "1471"},
{"-","かしこまりました。", "Certainly.", "20", "1472"},
{"軽い","かるい。", "light", "20", "1473"},
{"聞こえる","きこえる。", "to be audible", "20", "1474"},
{"交換する","こうかんする。", "to exchange", "20", "1475"},
{"-","ござる。", "extra-modest expression for thing exists ある", "20", "1476"},
{"-","さあ。", "I am not sure, . . .", "20","1477"},
{"差し上げる","さしあげる。", "humble expression for give あげる", "20", "1478"},
{"字","じ。", "letter; character", "20", "1479"},
{"失礼しました","しつれいしました。", "I’m very sorry.", "20", "1480"},
{"支店","してん。", "branch office", "20", "1481"},
{"少々","しょうしょう。", "a few seconds", "20", "1482"},
{"小説","しょうせつ。", "novel", "20", "1483"},
{"-","スニーカー。", "sneakers", "20", "1484"},
{"生活する","せいかつする。", "to lead a life", "20", "1485"},
{"扇子","せんす。", "fan", "20", "1486"},
{"-","それでは。", "if that is the case, . . .", "20","1487"},
{"月","つき。", "moon", "20", "1488"},
{"伝える","つたえる。", "to convey (message)", "20", "1489"},
{"-","～ておる。", "extra-modest expression for (tay eiru) ～ている", "20", "1490"},
{"-","できれば。", "if possible", "20", "1491"},
{"-","～でござる。", "extra-modest expression for (deh sue) です", "20", "1492"},
{"電子辞書","でんしじしょ。", "electronic dictionary", "20", "1493"},
{"-","ドイツ。", "Germany", "20", "1494"},
{"-","ハイヒール。", "high heels", "20", "1495"},
{"返品する","へんぴんする。", "to return (merchandise)", "20", "1496"},
{"参る","まいる。", "extra-modest expression for go and come いく, くる", "20","1497"},
{"誠に","まことに。", "really (very polite)", "20", "1498"},
{"待たせる","またせる。", "to keep (someone) waiting", "20", "1499"},
{"-","～みたいな。", "such as . . .", "20", "1500"},
{"申す","もうす。", "extra-modest expression for say いう", "20", "1501"},
{"～屋","～や。", ". . . shop", "20", "1502"},
{"-","よろしかったら。", "if it is okay (polite)", "20", "1503"},
{"角","かど。", "corner", "20", "1504"},
{"信号","しんごう。", "traffic light", "20", "1505"},
{"曲がる","まがる。", "to turn (right/left)", "20", "1506"},
{"趣味","しゅみ。", "hobby; pastime", "20", "1507"},
{"空港","くうこう。", "airport", "20", "1508"},
{"戻る","もどる。", "to return; to come/go back", "20", "1509"},
{"申し訳ありません","もうしわけありません。", "You have my apologies.", "20", "1510"},
{"-","また。", "again", "20", "1511"},
{"-","あんなに。", "so; such", "20.2", "1512"},
{"-","いなか。", "countryside", "20.2", "1513"},
{"売れる","うれる。", "to be sold", "20.2", "1514"},
{"-","えさ。", "feed", "20.2", "1515"},
{"江戸","えど。", "former name of Tokyo", "20.2", "1516"},
{"江戸時代","えどじだい。", "Edo period", "20.2", "1517"},
{"心","こころ。", "mind; heart", "20.2", "1518"},
{"最悪","さいあく。", "the worst", "20.2", "1519"},
{"主人","しゅじん。", "owner", "20.2", "1520"},
{"-","する。", "to cost", "20.2", "1521"},
{"-","そうだ！。", "I have an idea!", "20.2", "1522"},
{"抱く","だく。", "to hold something in one’s arm", "20.2", "1523"},
{"-","だます。", "to deceive", "20.2", "1524"},
{"茶店","ちゃみせ。", "teahouse", "20.2", "1525"},
{"止まる","とまる。", "to stop", "20.2", "1526"},
{"-","にこにこする。", "to smile", "20.2", "1527"},
{"値段","ねだん。", "price", "20.2", "1528"},
{"-","ひっかく。", "to scratch", "20.2", "1529"},
{"身ぶり","みぶり。", "gesture", "20.2", "1530"},
{"無理な","むりな。", "impossible", "20.2", "1531"},
{"-","やった！。", "I did it!", "20.2", "1532"},
{"落語","らくご。", "comic monologue", "20.2", "1533"},
{"落語家","らくごか。", "comic storyteller", "20.2", "1534"},
{"両","りょう。", "a unit of currency used in the Edo period", "20.2", "1535"},
{"渡す","わたす。", "to give; to hand", "20.2", "1536"},
{"終電","しゅうでん。", "last train", "21", "1537"},
{"～間に","～あいだに。", "while . . . ", "21", "1538"},
{"赤ちゃん","あかちゃん。", "baby", "21", "1539"},
{"安全","あんぜん（な）。", "safe", "21", "1540"},
{"-","いじめる。", "to bully", "21", "1541"},
{"置く","おく。", "to put; to lay; to place", "21", "1542"},
{"蚊","か。", "mosquito", "21", "1543"},
{"会議","かいぎ。", "business meeting; conference", "21", "1544"},
{"-","ガソリン。", "gasoline", "21", "1545"},
{"環境","かんきょう。", "environment", "21", "1546"},
{"着替える","きがえる。", "to change clothes", "21", "1547"},
{"気が付く","きがつく。", "to notice", "21", "1548"},
{"警察","けいさつ。", "police; police station", "21", "1549"},
{"-","ける。", "to kick", "21", "1550"},
{"工場","こうじょう。", "factory", "21", "1551"},
{"-","ころ。", "time of . . . ; when . . .", "21", "1552"},
{"刺す","さす。", "to bite", "21", "1553"},
{"触る","さわる。", "to touch", "21", "1554"},
{"準備","じゅんび。", "preparation", "21", "1555"},
{"-","スピーチ。", "speech", "21", "1556"},
{"政府","せいふ。", "government", "21", "1557"},
{"大切","たいせつ（な）。", "precious; valuable", "21", "1558"},
{"-","ためる。", "to save money", "21", "1559"},
{"-","ちかん。", "sexual offender; pervert", "21", "1560"},
{"捕まる","つかまる。", "to be arrested; to be caught", "21", "1561"},
{"続ける","つづける。", "to continue", "21", "1562"},
{"包む","つつむ。", "to wrap; to cover", "21", "1563"},
{"同僚","どうりょう。", "colleague", "21", "1564"},
{"遠い","とおい。", "far (away)", "21", "1565"},
{"-","とにかく。", "anyhow; anyway", "21", "1566"},
{"泥棒","どろぼう。", "thief; burglar", "21", "1567"},
{"殴る","なぐる。", "to strike; to hit; to punch", "21", "1568"},
{"盗む","ぬすむ。", "to steal; to rob", "21", "1569"},
{"-","バイト。", "abbreviation of アルバイト", "21", "1570"},
{"-","ばかにする。", "to insult; to make a fool of . . .", "21", "1571"},
{"貼る","はる。", "to post; to stick", "21", "1572"},
{"犯人","はんにん。", "criminal", "21", "1573"},
{"-","ひどい。", "awful", "21", "1574"},
{"昼寝をする","ひるねをする。", "to take a nap", "21", "1575"},
{"踏む","ふむ。", "to step on", "21", "1576"},
{"-","ふる。", "to turn down (somebody); to reject; to jilt", "21", "1577"},
{"-","ポスター。", "poster", "21", "1578"},
{"-","ほめる。", "to praise; to say nice things", "21", "1579"},
{"間違える","まちがえる。", "to make a mistake", "21", "1580"},
{"-","めちゃくちゃ（な）。", "messy; disorganized", "21", "1581"},
{"文句","もんく。", "complaint", "21", "1582"},
{"文句を言う","もんくをいう。", "to complain", "21", "1583"},
{"焼く","やく。", "to bake; to burn; to grill", "21", "1584"},
{"-","やる。", "to give (to pets, plants, younger siblings etc.)","21", "1585"},
{"留守","るす。", "absence; not at home", "21", "1586"},
{"連絡する","れんらくする。", "to contact", "21", "1587"},
{"-","びっくりする。", "to be surprised", "21", "1588"},
{"事","こと。", "things; matters", "21", "1589"},
{"見つける","みつける。", "to find", "21", "1590"},
{"昔","むかし。", "old days; past", "21", "1591"},
{"少し","すこし。", "a little", "21", "1592"},
{"一生懸命","いっしょうけんめい。", "very hard", "21.2", "1593"},
{"占い","うらない。", "fortunetelling", "21.2", "1594"},
{"多くの～","おおくの～。", "many . . .", "21.2", "1595"},
{"起こる","おこる。", "to occur; to happen", "21.2", "1596"},
{"お守り","おまもり。", "charm (against evils); amulet", "21.2", "1597"},
{"通う","かよう。", "to commute to", "21.2", "1598"},
{"気にする","きにする。", "to worry", "21.2", "1599"},
{"食事","しょくじ。", "meal", "21.2", "1600"},
{"信じる","しんじる。", "to believe", "21.2", "1601"},
{"-","ぜいたくをする。", "to indulge in luxury", "21.2", "1602"},
{"-","ただの～。", "nothing more than . . .", "21.2", "1603"},
{"楽しみ","たのしみ。", "pleasure", "21.2", "1604"},
{"-","ところが。", "however; on the contrary", "21.2", "1605"},
{"長い間","ながいあいだ。", "long time", "21.2", "1606"},
{"入院する","にゅういんする。", "to be hospitalized", "21.2", "1607"},
{"不便な","ふべんな。", "inconvenient", "21.2", "1608"},
{"迷信","めいしん。", "superstition", "21.2", "1609"},
{"-","めったに～ない。", "seldom", "21.2", "1610"},
{"相手","あいて。", "partner", "22", "1611"},
{"受付","うけつけ。", "reception desk", "22", "1612"},
{"-","うるさい。", "noisy; annoying", "22", "1613"},
{"英会話","えいかいわ。", "English conversation", "22", "1614"},
{"お嬢さん","おじょうさん。", "(someone’s) daughter (polite)", "22", "1615"},
{"お願いする","おねがいする。", "to pray for help", "22", "1616"},
{"家事","かじ。", "household matters", "22", "1617"},
{"風","かぜ。", "wind", "22", "1618"},
{"風が吹く","かぜがふく。", "the wind blows", "22", "1619"},
{"勝つ","かつ。", "to win", "22", "1620"},
{"木","き。", "tree", "22", "1621"},
{"計画を立てる","けいかくをたてる。", "to make a plan", "22", "1622"},
{"後輩","こうはい。", "junior member of a group", "22", "1623"},
{"コピーを取る","コピーをとる。", "to make a photocopy", "22", "1624"},
{"-","こんなふう。", "like this", "22", "1625"},
{"猿","さる。", "monkey", "22", "1626"},
{"賛成する","さんせいする。", "to agree", "22", "1627"},
{"失敗する","しっぱいする。", "to fail; to be unsuccessful", "22", "1628"},
{"自由","じゆう。", "freedom", "22", "1629"},
{"自由に","じゆうに。", "freely", "22", "1630"},
{"書類","しょるい。", "document", "22", "1631"},
{"-","ずっと。", "for a long time; all the time", "22", "1632"},
{"育てる","そだてる。", "to raise; to bring up", "22", "1633"},
{"-","そんなこと（は）ない。", "I don’t think so.", "22", "1634"},
{"徹夜する","てつやする。", "to stay up all night", "22", "1635"},
{"-","～とか。", ". . . for example", "22", "1636"},
{"運ぶ","はこぶ。", "to carry", "22", "1637"},
{"反対する","はんたいする。", "to oppose; to object to", "22", "1638"},
{"一人暮らし","ひとりぐらし。", "living alone", "22", "1639"},
{"拾う","ひろう。", "to pick up (something)", "22", "1640"},
{"貧乏","びんぼう（な）。", "poor", "22", "1641"},
{"部下","ぶか。", "subordinate", "22", "1642"},
{"復習","ふくしゅう。", "review of a lesson", "22", "1643"},
{"-","プロジェクト。", "project", "22", "1644"},
{"-","ぺらぺら（な）。", "fluent", "22", "1645"},
{"変","へん（な）。", "strange; unusual", "22", "1646"},
{"放っておく","ほ（う）っておく。", "to leave (someone/something) alone; to neglect", "22", "1647"},
{"-","ボール。", "ball", "22", "1648"},
{"翻訳する","ほんやくする。", "to translate", "22", "1649"},
{"負ける","まける。", "to lose (a match)", "22", "1650"},
{"間に合う","まにあう。", "to be in time", "22", "1651"},
{"無駄遣い","むだづかい。", "waste (money)", "22", "1652"},
{"免許","めんきょ。", "license", "22", "1653"},
{"もう少し","もうすこし。", "a little more", "22", "1654"},
{"-","ヨーロッパ。", "Europe", "22", "1655"},
{"予習","よしゅう。", "preparation of lessons", "22", "1656"},
{"楽","らく（な）。", "easy; comfortable", "22", "1657"},
{"神様","かみさま。", "God", "22", "1658"},
{"先輩","せんぱい。", "senior member of a group", "22", "1659"},
{"走る","はしる。", "to run", "22", "1660"},
{"助ける","たすける。", "to help; to rescue", "22", "1661"},
{"何度も","なんども。", "many times", "22", "1662"},
{"絶対に","ぜったいに。", "definitely; no matter what", "22", "1663"},
{"心配","しんぱい（な）。", "worried about", "22", "1664"},
{"塾","じゅく。", "cram school", "22", "1665"},
{"相変わらず","あいかわらず。", "as usual", "22.2", "1666"},
{"-","うまく。", "well; sucessfully; skillfully", "22.2", "1667"},
{"-","うまくいく。", "to go well", "22.2", "1668"},
{"-","うらやましがる。", "(somebody is) envious", "22.2", "1669"},
{"帰ってくる","かえってくる。", "to come back home", "22.2", "1670"},
{"代わりに","かわりに。", "instead", "22.2", "1671"},
{"-","しかたがない。", "cannot be helped", "22.2", "1672"},
{"親友","しんゆう。", "best friend", "22.2", "1673"},
{"-","タイプ。", "type", "22.2", "1674"},
{"楽しそうに","たのしそうに。", "joyfully", "22.2", "1675"},
{"伝言","でんごん。", "message", "22.2", "1676"},
{"-","なんだか。", "somehow", "22.2", "1677"},
{"逃げる","にげる。", "to run away; to escape", "22.2", "1678"},
{"二日間","ふつかかん。", "for two days", "22.2", "1679"},
{"待ち遠しい","まちどおしい。", "to wait eagerly for . . . ", "22.2", "1680"},
{"勇気","ゆうき。", "courage", "22.2", "1681"},
{"雨がやむ","あめがやむ。", "the rain stops", "23", "1682"},
{"-","いなくなる。", "(someone) is gone; to disappear", "23", "1683"},
{"-","いや。", "no", "23", "1684"},
{"-","おなかをこわす。", "to have a stomachache", "23", "1685"},
{"思い出","おもいで。", "memory", "23", "1686"},
{"海外旅行","かいがいりょこう。", "trip to a foreign country", "23", "1687"},
{"換える","かえる。", "to change", "23", "1688"},
{"～顔をする","～かおをする。", "to look . . . (facial expression)", "23", "1689"},
{"我慢する","がまんする。", "to be tolerant/patient", "23", "1690"},
{"気に入る","きにいる。", "to find something agreeable", "23", "1691"},
{"靴下","くつした。", "socks", "23", "1692"},
{"元気でね","げんきでね。", "Take care of yourself.", "23", "1693"},
{"国際電話","こくさいでんわ。", "international call", "23", "1694"},
{"社会","しゃかい。", "society", "23", "1695"},
{"授業料","じゅぎょうりょう。", "tuition", "23", "1696"},
{"小学校","しょうがっこう。", "elementary school", "23", "1697"},
{"世話をする","せわをする。", "to take care of . . .", "23", "1698"},
{"選挙","せんきょ。", "election", "23", "1699"},
{"-","そうそう。", "You are right.", "23", "1700"},
{"-","ソフト。", "software", "23", "1701"},
{"-","そろそろ。", "it is about time to . . .", "23", "1702"},
{"-","タイヤ。", "tire", "23", "1703"},
{"-","ただ。", "free of charge", "23", "1704"},
{"同情する","どうじょうする。", "to sympathize", "23", "1705"},
{"-","なくなる。", "to be lost; to disappear", "23", "1706"},
{"離れる","はなれる。", "(something/someone) separates; parts from", "23", "1707"},
{"-","パンクする。", "(tire) goes flat", "23", "1708"},
{"別荘","べっそう。", "villa; vacation home", "23", "1709"},
{"-","ボーナス。", "bonus", "23", "1710"},
{"盆踊り","ぼんおどり。", "Bon dance (Japanese traditional dance)", "23", "1711"},
{"-","まずい。", "(food is) terrible", "23", "1712"},
{"面接","めんせつ。", "interview", "23", "1713"},
{"戻ってくる","もどってくる。", "(something/someone) comes back", "23", "1714"},
{"-","ものすごく。", "extremely", "23", "1715"},
{"優勝する","ゆうしょうする。", "to win a championship", "23", "1716"},
{"夕食","ゆうしょく。", "dinner", "23", "1717"},
{"理想","りそう。", "ideal", "23", "1718"},
{"留守番","るすばん。", "looking after a house during someone’s absence", "23", "1719"},
{"悪口を言う","わるぐちをいう。", "to talk behind someone’s back", "23", "1720"},
{"体","からだ。", "body", "23", "1721"},
{"-","そんな～。", "such . . . ; that kind of . . .", "23", "1722"},
{"違う","ちがう。", "to be different; wrong", "23", "1723"},
{"場所","ばしょ。", "place", "23", "1724"},
{"お世話になる","おせわになる。", "to be in someone’s care", "23", "1725"},
{"受ける","うける。", "to take (an examination, interview, etc.)","23","1726"},
{"-","がっかりする。", "to be disappointed", "23", "1727"},
{"答える","こたえる。", "to answer", "23", "1728"},
{"最後に","さいごに。", "finally; lastly", "23", "1729"},
{"表す","あらわす。", "to express; to show", "23.2", "1730"},
{"同じような","おなじような。", "similar", "23.2", "1731"},
{"感情","かんじょう。", "feeling; emotion", "23.2", "1732"},
{"簡単に","かんたんに。", "easily", "23.2", "1733"},
{"気持ち","きもち。", "feeling", "23.2", "1734"},
{"比べる","くらべる。", "to compare", "23.2", "1735"},
{"結果","けっか。", "result", "23.2", "1736"},
{"-","このように。", "like this; this way", "23.2", "1737"},
{"最後の～","さいごの～。", "last . . . ", "23.2", "1738"},
{"最初の～","さいしょの～。", "first . . . ", "23.2", "1739"},
{"冗談","じょうだん。", "joke", "23.2", "1740"},
{"全員","ぜんいん。", "all members", "23.2", "1741"},
{"縦","たて。", "vertical", "23.2", "1742"},
{"調査","ちょうさ。", "survey", "23.2", "1743"},
{"-","～によって。", "depending on . . . ", "23.2", "1744"},
{"人間","にんげん。", "human being", "23.2", "1745"},
{"-","バンザイをする。", "to raise hands and shout Banzai!", "23.2", "1746"},
{"表情","ひょうじょう。", "facial expression", "23.2", "1747"},
{"-","ほとんど。", "almost", "23.2", "1748"},
{"-","マーク。", "mark", "23.2", "1749"},
{"横","よこ。", "side; horizontal", "23.2", "1750"},
{ "ある日","あるひ","one day","0","1751"},
{"年上","としうえ","senior citizen","0","1752"},
{"急に","きゅうに","suddenly","0","1753"},
{"一年中","いちねんじゅう","all year around","0","1754"},
{"場所","ばしょ","place","0","1755"},
{"小学生","しょうがくせい","elementary school","0","1756"},
{"見方","みかた","person on one's side","0","1757"},
{"教室","きょうしつ","classroom","0","1758"},
{"教室","きょうしつ","classroom","0","1759"},
{"文字","もじ","alphabet letter","0","1760"},
{"年代","ねんだい","era","0","1761"},
{"その後","そのご","after that","0","1762"},
{"何度も","なんども","many times","0","1763"},
{"女子","じょし","girl","0","1764"},
{"男子","だんし","boy","0","1765"},
{"以上","いじょう","or more","0","1766"},
{"電気代","でんきだい","electric bill","0","1767"},
{"毎月","まいつき","every month","0","1768"},
{"食堂","しょくど","cafeteria","0","1769"},
{"三日","みっか","three days","0","1770"},
{"空手","からて","karate","0","1771"},
{"親しい","したし","intimate","0","1772"},
{"世話","せわ","assistance","0","1773"},
{"不安","ふあん","anxiety","0","1774"},
{"思い出す","おもいだす","to recall","0","1775"},
{"大切","たいせつ","precious necessary","0","1776"},
{"友人","ゆうじん","friend","0","1777"},
{"特に","とくに","particularly","0","1778"},
{"活動","かつどう","activity","0","1779"},
{"分野","ぶにゃ","field of endeavor","0","1780"},
{"作品","さくひん","piece of work","0","1781"},
{"出発","しゅっぱつ","departure","0","1782"},
{"主二","おもに","mainly","0","1783"},
{"発音","はつおん","pronunciation-","0","1784"},
{"教授","きょうじゅ","professor","0","1785"},
{"力仕事","ちからしごと","physical labor","0","1786"},
{"和服","わふく","japanese clothing","0","1787"},
{"洋服","よふく","western clothing","0","1788"},
{"目的","もくてき","purpose","0","1789"},
{"不安な","ふあん","uneasy","0","1790"},
{"質問","しつもん","question","0","1791"},
{"工事","こうじ","construction","0","1792"},
{"工学","こがく","engineering","0","1793"},
{"祭神","さいしん","the latest","0","1794"},
{"最悪","さいあく","the worst","0","1795"},
{"心","こころ","heart;mind","0","1796"},
{"両手","りょうて","both hands","0","1797"},
{"最後に","さいごに","lastly","0","1798"},
{"最高","さいこ","the best","0","1799"},
{"絶対に","ぜったいに","definitely","0","1800"},
{"声","こえ","voice","0","1801"},
{"止まる","とまる","something stops","0","1802"},
{"続ける","つづける","to continue","0","1803"},
{"無理な","むりな","impossible","0","1804"},
{"中止する","ちゅうしする","cancel","0","1805"},
{"最も","もっとも","most","0","1806"},
{"絶対に","ぜったいに","definitely","0","1807"},
{"両方","りょうほう","both","0","1808"},
{"最近","さいきん","recently","0","1809"},
{"無料","むりょう","free of charge","0","1810"},
};








        bool dataisloaded = false;
        long elapsedSeconds = 0;  //seconds of game play
        long nowtime = 0;
        bool startGame = false;
        bool specialfound = false;
        int start_pause = 0;
        bool japanesemode = false; //saying japanese words
        //bool asynchtalking=true;
        int jmode = 0;
        bool mixedmode = true; //switch between japanese and english modes
        int currentchapter=0;
        int currentword = 0;
        int newtry = 0;
        int lastcurrentword=0;
        int previouslastcurrentword = 0;
        int specialindex = 0;
        int searchlimit = 0;
        private int jspeechRate = 0;
        private int espeechRate = 0;
        private string j_word = "";  // japanese word (kanji)
        private string k_word=""; //japanese word (hiragana)
        private string e_word="";     //english word or phrase
        private string first_choice; //possible answers
        private string second_choice;
        int mistakenumber = 0;
        bool pleaserepeatword = false;
        String reconText;
        float reconConfidence;

        //end of global variables **********************************************

        //the background worker is a thread handling speech recognition
        private BackgroundWorker bw = new BackgroundWorker();
       
        //instantiate speech recognizer in japanese
        SpeechRecognitionEngine recognizer =
            new SpeechRecognitionEngine(new System.Globalization.CultureInfo("ja-JP"));

        //instantiate speech engine (talker)
        SpeechSynthesizer synth = new SpeechSynthesizer();


        Choices list = new Choices();
        Random rand1 = new Random();
        Random rand2 = new Random();
        PromptBuilder pb = new PromptBuilder();


        //start of program *****************************************

        public Form1()
        {        
            InitializeComponent();
            //bw is the background worker
            bw.DoWork += new DoWorkEventHandler(bw_DoWork);
            bw.RunWorkerCompleted += new RunWorkerCompletedEventHandler(bw_RunWorkerCompleted);
           
        }


        //GAME state machine ************************************************************
        private void timer1_Tick_1(object sender, EventArgs e)
        {
            elapsedSeconds++;
            string turns = elapsedSeconds.ToString();
            Application.DoEvents();          
            while ((startGame == true) && (start_pause!=2))  //turns game off during recognition time
            {

                //pick random word 
                //this section pick a word according to the Genki chapters that are checked
                //taking the word from that chapter that has the minimum plays



                if (pleaserepeatword == false) //only get new word if old word okay
                {
                    
                    bool gotit = false;
                    //pleaserepeatword = true;
                    //MessageBox.Show("successwordcount"+newstats.successwordcount);
                    //first check for special words
                    //newstats.superwords[5] = 0;
                    if (newstats.successwordcount % 5 == 0)
                    {
                        searchlimit = 0;
                        specialfound = false;
                        //MessageBox.Show("at special words place");
                        while ((specialfound == false) && (searchlimit < 200))
                        {
                            specialindex = rand1.Next(0, 50);
                            if (newstats.superwords[specialindex] != 0)
                            {
                                specialfound = true;
                                SystemSounds.Asterisk.Play();                             
                                currentword = newstats.superwords[specialindex]+1;                                
                                gotit=true;
                            }
                            searchlimit++;
                        }
                        specialfound = true; //timed out
                        //if (gotit==true) MessageBox.Show("special word is" + currentword);
                    }

                    //if (radioButton4.Checked == true) asynchtalking = true;
                   // else asynchtalking = false;


                        //which mode?  both listening and talking
                        if (radioButton3.Checked == true)
                    {
                        if (newstats.successwordcount % 10 > 4) japanesemode = true;
                        else japanesemode = false;
                    }
                    else if (radioButton1.Checked == true) japanesemode = false;
                    else if (radioButton2.Checked == true) japanesemode = true;
                    if (japanesemode == false) jmode = 0; else jmode = 1;


                    while (gotit == false) //if word not special, search for words from selected chapters
                    {
                      
                        //pick a random selected chapter
                        currentchapter = rand2.Next(0, 46); //one less than upper range
                        //MessageBox.Show(currentchapter.ToString(), checkBox1.Checked.ToString());
                        int min = 999; //reset minimum play

                        if ((currentchapter == 0) && (checkBox1.Checked))
                        {
                            gotit = true;
                            for (int x = 0; x < 100; x++)
                            {
                                newtry = rand1.Next(0, 18);
                                if (newstats.wordrecord[jmode, newtry] <= min)
                                {
                                    min = (newstats.wordrecord[jmode, newtry]);
                                    currentword = newtry;
                                }
                            }
                             newstats.wordrecord[jmode, currentword]++;
                        }
                        else if
                         ((currentchapter == 1) && (checkBox2.Checked))
                        {
                            gotit = true;
                            for (int x = 0; x < 100; x++)
                            {
                                newtry = rand1.Next(18, 82);
                                if (newstats.wordrecord[jmode, newtry] <= min)
                                {
                                    min = (newstats.wordrecord[jmode, newtry]);
                                    currentword = newtry;
                                }
                            }
                             newstats.wordrecord[jmode, currentword]++;
                        }
                        else if
                         ((currentchapter == 2) && (checkBox3.Checked))
                        {
                            gotit = true;
                            for (int x = 0; x < 100; x++)
                            {
                                newtry = rand1.Next(82, 130);
                                if (newstats.wordrecord[jmode, newtry] <= min)
                                {
                                    min = (newstats.wordrecord[jmode, newtry]);
                                    currentword = newtry;
                                }
                            }
                             newstats.wordrecord[jmode, currentword]++;
                        }
                        else if
                         ((currentchapter == 3) && (checkBox4.Checked))
                        {
                            gotit = true;
                            for (int x = 0; x < 100; x++)
                            {
                                newtry = rand1.Next(130, 180);
                                if (newstats.wordrecord[jmode, newtry] <= min)
                                {
                                    min = (newstats.wordrecord[jmode, newtry]);
                                    currentword = newtry;
                                }
                            }
                             newstats.wordrecord[jmode, currentword]++;
                        }
                        else if
                         ((currentchapter == 4) && (checkBox5.Checked))
                        {
                            gotit = true;
                            for (int x = 0; x < 100; x++)
                            {
                                newtry = rand1.Next(180, 236);
                                if (newstats.wordrecord[jmode, newtry] <= min)
                                {
                                    min = (newstats.wordrecord[jmode, newtry]);
                                    currentword = newtry;
                                }
                            }
                             newstats.wordrecord[jmode, currentword]++;
                        }
                        else if
                        ((currentchapter == 5) && (checkBox6.Checked))
                        {
                            gotit = true;
                            for (int x = 0; x < 100; x++)
                            {
                                newtry = rand1.Next(236, 299);
                                if (newstats.wordrecord[jmode, newtry] <= min)
                                {
                                    min = (newstats.wordrecord[jmode, newtry]);
                                    currentword = newtry;
                                }
                            }
                             newstats.wordrecord[jmode, currentword]++;
                        }
                        else if
                         ((currentchapter == 6) && (checkBox7.Checked))
                        {
                            gotit = true;
                            for (int x = 0; x < 100; x++)
                            {
                                newtry = rand1.Next(299, 333);
                                if (newstats.wordrecord[jmode, newtry] <= min)
                                {
                                    min = (newstats.wordrecord[jmode, newtry]);
                                    currentword = newtry;
                                }
                            }
                             newstats.wordrecord[jmode, currentword]++;
                        }
                        else if
                         ((currentchapter == 7) && (checkBox8.Checked))
                        {
                            gotit = true;
                            for (int x = 0; x < 100; x++)
                            {
                                newtry = rand1.Next(333, 388);
                                if (newstats.wordrecord[jmode, newtry] <= min)
                                {
                                    min = (newstats.wordrecord[jmode, newtry]);
                                    currentword = newtry;
                                }
                            }
                             newstats.wordrecord[jmode, currentword]++;
                        }
                        else if
                         ((currentchapter == 8) && (checkBox9.Checked))
                        {
                            gotit = true;
                            for (int x = 0; x < 100; x++)
                            {
                                newtry = rand1.Next(388, 399);
                                if (newstats.wordrecord[jmode, newtry] <= min)
                                {
                                    min = (newstats.wordrecord[jmode, newtry]);
                                    currentword = newtry;
                                }
                            }
                             newstats.wordrecord[jmode, currentword]++;
                        }
                        else if
                         ((currentchapter == 9) && (checkBox10.Checked))
                        {
                            gotit = true;
                            for (int x = 0; x < 100; x++)
                            {
                                newtry = rand1.Next(399, 453);
                                if (newstats.wordrecord[jmode, newtry] <= min)
                                {
                                    min = (newstats.wordrecord[jmode, newtry]);
                                    currentword = newtry;
                                }
                            }
                             newstats.wordrecord[jmode, currentword]++;
                        }
                        else if
                         ((currentchapter == 10) && (checkBox11.Checked))
                        {
                            gotit = true;
                            for (int x = 0; x < 100; x++)
                            {
                                newtry = rand1.Next(453, 467);
                                if (newstats.wordrecord[jmode, newtry] <= min)
                                {
                                    min = (newstats.wordrecord[jmode, newtry]);
                                    currentword = newtry;
                                }
                            }
                             newstats.wordrecord[jmode, currentword]++;
                        }
                        else if
                         ((currentchapter == 11) && (checkBox12.Checked))
                        {
                            gotit = true;
                            for (int x = 0; x < 100; x++)
                            {
                                newtry = rand1.Next(467, 523);
                                if (newstats.wordrecord[jmode, newtry] <= min)
                                {
                                    min = (newstats.wordrecord[jmode, newtry]);
                                    currentword = newtry;
                                }
                            }
                             newstats.wordrecord[jmode, currentword]++;
                        }
                        else if
                         ((currentchapter == 12) && (checkBox13.Checked))
                        {
                            gotit = true;
                            for (int x = 0; x < 100; x++)
                            {
                                newtry = rand1.Next(523, 536);
                                if (newstats.wordrecord[jmode, newtry] <= min)
                                {
                                    min = (newstats.wordrecord[jmode, newtry]);
                                    currentword = newtry;
                                }
                            }
                             newstats.wordrecord[jmode, currentword]++;
                        }
                        else if 
                            ((currentchapter == 13) && (checkBox14.Checked))
                        {
                            gotit = true;
                            for (int x = 0; x < 100; x++)
                            {
                                newtry = rand1.Next(536, 588);
                                if (newstats.wordrecord[jmode, newtry] <= min)
                                {
                                    min = (newstats.wordrecord[jmode, newtry]);
                                    currentword = newtry;
                                }
                            }
                             newstats.wordrecord[jmode, currentword]++;
                        }
                       else if 
                            ((currentchapter == 14) && (checkBox15.Checked))
                        {
                            gotit = true;
                            for (int x = 0; x < 100; x++)
                            {
                                newtry = rand1.Next(588, 639);
                                if (newstats.wordrecord[jmode, newtry] <= min)
                                {
                                    min = (newstats.wordrecord[jmode, newtry]);
                                    currentword = newtry;
                                }
                            }
                             newstats.wordrecord[jmode, currentword]++;
                        }
                        else if
                         ((currentchapter == 15) && (checkBox16.Checked))
                        {
                            gotit = true;
                            for (int x = 0; x < 100; x++)
                            {
                                newtry = rand1.Next(639, 659);
                                if (newstats.wordrecord[jmode, newtry] <= min)
                                {
                                    min = (newstats.wordrecord[jmode, newtry]);
                                    currentword = newtry;
                                }
                            }
                             newstats.wordrecord[jmode, currentword]++;
                        }
                        else if
                         ((currentchapter == 16) && (checkBox17.Checked))
                        {
                            gotit = true;
                            for (int x = 0; x < 100; x++)
                            {
                                newtry = rand1.Next(659, 715);
                                if (newstats.wordrecord[jmode, newtry] <= min)
                                {
                                    min = (newstats.wordrecord[jmode, newtry]);
                                    currentword = newtry;
                                }
                            }
                             newstats.wordrecord[jmode, currentword]++;
                        }
                        else if
                         ((currentchapter == 17) && (checkBox18.Checked))
                        {
                            gotit = true;
                            for (int x = 0; x < 100; x++)
                            {
                                newtry = rand1.Next(715, 757);
                                if (newstats.wordrecord[jmode, newtry] <= min)
                                {
                                    min = (newstats.wordrecord[jmode, newtry]);
                                    currentword = newtry;
                                }
                            }
                             newstats.wordrecord[jmode, currentword]++;
                        }
                        else if
                         ((currentchapter == 18) && (checkBox19.Checked))
                        {
                            gotit = true;
                            for (int x = 0; x < 100; x++)
                            {
                                newtry = rand1.Next(757, 820);
                                if (newstats.wordrecord[jmode, newtry] <= min)
                                {
                                    min = (newstats.wordrecord[jmode, newtry]);
                                    currentword = newtry;
                                }
                            }
                             newstats.wordrecord[jmode, currentword]++;
                        }
                        else if
                         ((currentchapter == 19) && (checkBox20.Checked))
                        {
                            gotit = true;
                            for (int x = 0; x < 100; x++)
                            {
                                newtry = rand1.Next(820, 844);
                                if (newstats.wordrecord[jmode, newtry] <= min)
                                {
                                    min = (newstats.wordrecord[jmode, newtry]);
                                    currentword = newtry;
                                }
                            }
                             newstats.wordrecord[jmode, currentword]++;
                        }
                        else if
                         ((currentchapter == 20) && (checkBox21.Checked))
                        {
                            gotit = true;
                            for (int x = 0; x < 100; x++)
                            {
                                newtry = rand1.Next(844, 896);
                                if (newstats.wordrecord[jmode, newtry] <= min)
                                {
                                    min = (newstats.wordrecord[jmode, newtry]);
                                    currentword = newtry;
                                }
                            }
                             newstats.wordrecord[jmode, currentword]++;
                        }
                        else if
                         ((currentchapter == 21) && (checkBox22.Checked))
                        {
                            gotit = true;
                            for (int x = 0; x < 100; x++)
                            {
                                newtry = rand1.Next(896, 926);
                                if (newstats.wordrecord[jmode, newtry] <= min)
                                {
                                    min = (newstats.wordrecord[jmode, newtry]);
                                    currentword = newtry;
                                }
                            }
                             newstats.wordrecord[jmode, currentword]++;
                        }
                        else if
                         ((currentchapter == 22) && (checkBox23.Checked))
                        {
                            gotit = true;
                            for (int x = 0; x < 100; x++)
                            {
                                newtry = rand1.Next(926, 982);
                                if (newstats.wordrecord[jmode, newtry] <= min)
                                {
                                    min = (newstats.wordrecord[jmode, newtry]);
                                    currentword = newtry;
                                }
                            }
                             newstats.wordrecord[jmode, currentword]++;
                        }
                        else if
                         ((currentchapter == 23) && (checkBox24.Checked))
                        {
                            gotit = true;
                            for (int x = 0; x < 100; x++)
                            {
                                newtry = rand1.Next(982, 1011);
                                if (newstats.wordrecord[jmode, newtry] <= min)
                                {
                                    min = (newstats.wordrecord[jmode, newtry]);
                                    currentword = newtry;
                                }
                            }
                             newstats.wordrecord[jmode, currentword]++;
                        }
                        else if
                         ((currentchapter == 24) && (checkBox25.Checked))
                        {
                            gotit = true;
                            for (int x = 0; x < 100; x++)
                            {
                                newtry = rand1.Next(1011, 1063);
                                if (newstats.wordrecord[jmode, newtry] <= min)
                                {
                                    min = (newstats.wordrecord[jmode, newtry]);
                                    currentword = newtry;
                                }
                            }
                             newstats.wordrecord[jmode, currentword]++;
                        }
                        else if
                         ((currentchapter == 25) && (checkBox26.Checked))
                        {
                            gotit = true;
                            for (int x = 0; x < 100; x++)
                            {
                                newtry = rand1.Next(1063, 1071);
                                if (newstats.wordrecord[jmode, newtry] <= min)
                                {
                                    min = (newstats.wordrecord[jmode, newtry]);
                                    currentword = newtry;
                                }
                            }
                             newstats.wordrecord[jmode, currentword]++;
                        }
                        else if 
                            ((currentchapter == 26) && (checkBox27.Checked))
                        {
                            gotit = true;
                            for (int x = 0; x < 100; x++)
                            {
                                newtry = rand1.Next(1071, 1119);
                                if (newstats.wordrecord[jmode, newtry] <= min)
                                {
                                    min = (newstats.wordrecord[jmode, newtry]);
                                    currentword = newtry;
                                }
                            }
                             newstats.wordrecord[jmode, currentword]++;
                        }
                        else if
                        ((currentchapter == 27) && (checkBox28.Checked))
                        {
                            gotit = true;
                            for (int x = 0; x < 100; x++)
                            {
                                newtry = rand1.Next(1120, 1154);
                                if (newstats.wordrecord[jmode, newtry] <= min)
                                {
                                    min = (newstats.wordrecord[jmode, newtry]);
                                    currentword = newtry;
                                }
                            }
                             newstats.wordrecord[jmode, currentword]++;
                        }
                        else if
                         ((currentchapter == 28) && (checkBox29.Checked))
                        {
                            gotit = true;
                            for (int x = 0; x < 100; x++)
                            {
                                newtry = rand1.Next(1154, 1202);
                                if (newstats.wordrecord[jmode, newtry] <= min)
                                {
                                    min = (newstats.wordrecord[jmode, newtry]);
                                    currentword = newtry;
                                }
                            }
                             newstats.wordrecord[jmode, currentword]++;
                        }
                        else if
                         ((currentchapter == 29) && (checkBox30.Checked))
                        {
                            gotit = true;
                            for (int x = 0; x < 100; x++)
                            {
                                newtry = rand1.Next(1202, 1219);
                                if (newstats.wordrecord[jmode, newtry] <= min)
                                {
                                    min = (newstats.wordrecord[jmode, newtry]);
                                    currentword = newtry;
                                }
                            }
                             newstats.wordrecord[jmode, currentword]++;
                        }
                        else if
                         ((currentchapter == 30) && (checkBox31.Checked))
                        {
                            gotit = true;
                            for (int x = 0; x < 100; x++)
                            {
                                newtry = rand1.Next(1219, 1277);
                                if (newstats.wordrecord[jmode, newtry] <= min)
                                {
                                    min = (newstats.wordrecord[jmode, newtry]);
                                    currentword = newtry;
                                }
                            }
                             newstats.wordrecord[jmode, currentword]++;
                        }
                        else if
                         ((currentchapter == 31) && (checkBox32.Checked))
                        {
                            gotit = true;
                            for (int x = 0; x < 100; x++)
                            {
                                newtry = rand1.Next(1277, 1313);
                                if (newstats.wordrecord[jmode, newtry] <= min)
                                {
                                    min = (newstats.wordrecord[jmode, newtry]);
                                    currentword = newtry;
                                }
                            }
                             newstats.wordrecord[jmode, currentword]++;
                        }
                        else if
                         ((currentchapter == 32) && (checkBox33.Checked))
                        {
                            gotit = true;
                            for (int x = 0; x < 100; x++)
                            {
                                newtry = rand1.Next(1313, 1367);
                                if (newstats.wordrecord[jmode, newtry] <= min)
                                {
                                    min = (newstats.wordrecord[jmode, newtry]);
                                    currentword = newtry;
                                }
                            }
                             newstats.wordrecord[jmode, currentword]++;
                        }
                        else if
                         ((currentchapter == 33) && (checkBox34.Checked))
                        {
                            gotit = true;
                            for (int x = 0; x < 100; x++)
                            {
                                newtry = rand1.Next(1368, 1386);
                                if (newstats.wordrecord[jmode, newtry] <= min)
                                {
                                    min = (newstats.wordrecord[jmode, newtry]);
                                    currentword = newtry;
                                }
                            }
                             newstats.wordrecord[jmode, currentword]++;
                        }
                        else if
                         ((currentchapter == 34) && (checkBox35.Checked))
                        {
                            gotit = true;
                            for (int x = 0; x < 100; x++)
                            {
                                newtry = rand1.Next(1386, 1438);
                                if (newstats.wordrecord[jmode, newtry] <= min)
                                {
                                    min = (newstats.wordrecord[jmode, newtry]);
                                    currentword = newtry;
                                }
                            }
                             newstats.wordrecord[jmode, currentword]++;
                        }
                        else if
                         ((currentchapter == 35) && (checkBox36.Checked))
                        {
                            gotit = true;
                            for (int x = 0; x < 100; x++)
                            {
                                newtry = rand1.Next(1438, 1459);
                                if (newstats.wordrecord[jmode, newtry] <= min)
                                {
                                    min = (newstats.wordrecord[jmode, newtry]);
                                    currentword = newtry;
                                }
                            }
                             newstats.wordrecord[jmode, currentword]++;
                        }
                        else if
                         ((currentchapter == 36) && (checkBox37.Checked))
                        {
                            gotit = true;
                            for (int x = 0; x < 100; x++)
                            {
                                newtry = rand1.Next(1459, 1510);
                                if (newstats.wordrecord[jmode, newtry] <= min)
                                {
                                    min = (newstats.wordrecord[jmode, newtry]);
                                    currentword = newtry;
                                }
                            }
                             newstats.wordrecord[jmode, currentword]++;
                        }
                        else if 
                            ((currentchapter == 37) && (checkBox38.Checked))
                        {
                            gotit = true;
                            for (int x = 0; x < 100; x++)
                            {
                                newtry = rand1.Next(1510, 1536);
                                if (newstats.wordrecord[jmode, newtry] <= min)
                                {
                                    min = (newstats.wordrecord[jmode, newtry]);
                                    currentword = newtry;
                                }
                            }
                             newstats.wordrecord[jmode, currentword]++;
                        }
                        else if
                         ((currentchapter == 38) && (checkBox39.Checked))
                        {
                            gotit = true;
                            for (int x = 0; x < 100; x++)
                            {
                                newtry = rand1.Next(1536, 1592);
                                if (newstats.wordrecord[jmode, newtry] <= min)
                                {
                                    min = (newstats.wordrecord[jmode, newtry]);
                                    currentword = newtry;
                                }
                            }
                             newstats.wordrecord[jmode, currentword]++;
                        }
                        else if
                         ((currentchapter == 40) && (checkBox40.Checked))
                        {
                            gotit = true;
                            for (int x = 0; x < 100; x++)
                            {
                                newtry = rand1.Next(1592, 1610);
                                if (newstats.wordrecord[jmode, newtry] <= min)
                                {
                                    min = (newstats.wordrecord[jmode, newtry]);
                                    currentword = newtry;
                                }
                            }
                             newstats.wordrecord[jmode, currentword]++;
                        }
                        else if
                         ((currentchapter == 41) && (checkBox41.Checked))
                        {
                            gotit = true;
                            for (int x = 0; x < 100; x++)
                            {
                                newtry = rand1.Next(1610, 1665);
                                if (newstats.wordrecord[jmode, newtry] <= min)
                                {
                                    min = (newstats.wordrecord[jmode, newtry]);
                                    currentword = newtry;
                                }
                            }
                             newstats.wordrecord[jmode, currentword]++;
                        }
                        else if
                         ((currentchapter == 42) && (checkBox42.Checked))
                        {
                            gotit = true;
                            for (int x = 0; x < 100; x++)
                            {
                                newtry = rand1.Next(1665, 1681);
                                if (newstats.wordrecord[jmode, newtry] <= min)
                                {
                                    min = (newstats.wordrecord[jmode, newtry]);
                                    currentword = newtry;
                                }
                            }
                             newstats.wordrecord[jmode, currentword]++;
                        }
                        else if
                         ((currentchapter == 42) && (checkBox43.Checked))
                        {
                            gotit = true;
                            for (int x = 0; x < 100; x++)
                            {
                                newtry = rand1.Next(1681, 1729);
                                if (newstats.wordrecord[jmode, newtry] <= min)
                                {
                                    min = (newstats.wordrecord[jmode, newtry]);
                                    currentword = newtry;
                                }
                            }
                             newstats.wordrecord[jmode, currentword]++;
                        }
                        else if
                         ((currentchapter == 43) && (checkBox44.Checked))
                        {
                            gotit = true;
                            for (int x = 0; x < 100; x++)
                            {
                                newtry = rand1.Next(1729, 1750);
                                if (newstats.wordrecord[jmode, newtry] <= min)
                                {
                                    min = (newstats.wordrecord[jmode, newtry]);
                                    currentword = newtry;
                                }
                            }
                             newstats.wordrecord[jmode, currentword]++;
                        }
                        else if
                        ((currentchapter == 44) && (checkBox45.Checked))
                        {
                            gotit = true;
                            for (int x = 0; x < 100; x++)
                            {
                                newtry = rand1.Next(1750, 1777);
                                if (newstats.wordrecord[jmode, newtry] <= min)
                                {
                                    min = (newstats.wordrecord[jmode, newtry]);
                                    currentword = newtry;
                                }
                            }
                             newstats.wordrecord[jmode, currentword]++;
                        }
                        else if
                       ((currentchapter == 45) && (checkBox46.Checked))
                        {
                            gotit = true;
                            for (int x = 0; x < 100; x++)
                            {
                                newtry = rand1.Next(1777, 1809);
                                if (newstats.wordrecord[jmode, newtry] <= min)
                                {
                                    min = (newstats.wordrecord[jmode, newtry]);
                                    currentword = newtry;
                                }
                            }
                             newstats.wordrecord[jmode, currentword]++;
                        }
                    }
                    pleaserepeatword = true;
                    //if (currentword != 0) currentword--;
                    //MessageBox.Show("current word is now" + currentword);
                    
                }
               // else
               // {
                //    pleaserepeatword = false;
               // }

               
               
                //print out lastwords used 

                textBox2.AppendText("count:" + newstats.wordrecord[jmode, lastcurrentword] + "      last word: " + lastcurrentword + "\n\n");
                textBox2.AppendText("\n\n");
                textBox2.AppendText(e_word);
                textBox2.AppendText("\n");
                textBox2.AppendText(j_word);
                textBox2.AppendText("\n");
                textBox2.AppendText(k_word);
                textBox2.AppendText("\n");
                //print out currentwords used

                textBox1.AppendText("count:" + newstats.wordrecord[jmode, currentword] + "          current word: " + currentword + "\n\n");
                k_word = monsterstring[currentword, 0];
                j_word = monsterstring[currentword, 1]; //override
                //if (j_word=="-") j_word = monsterstring[currentword, 1]; //if no kanji, use hirigana
                e_word = monsterstring[currentword, 2];
                textBox1.AppendText("\n\n");
                textBox1.AppendText(e_word);
                textBox1.AppendText("\n");
                textBox1.AppendText(j_word);
                textBox1.AppendText("\n");
                textBox1.AppendText(k_word);
                textBox1.AppendText("\n");
                previouslastcurrentword = lastcurrentword;
                lastcurrentword = currentword;

                if (japanesemode == true)//japanese mode says japanese words
                {                  
                    synth.Rate = jspeechRate;
                    pb.ClearContent();
                    pb.AppendSsmlMarkup("<voice xml:lang=\"ja-JP\">");
                    pb.AppendText(j_word);
                    pb.AppendSsmlMarkup("</voice>");
                    if (radioButton4.Checked == true) synth.SpeakAsync(pb);  //start speech synthesizer
                    else synth.Speak(pb); //jody fix
                    //SystemSounds.Question.Play();
                    // in the japanese mode you can say yes or no
                    first_choice = "はい";
                    second_choice = "いいえ";
                }
                else //english mode--says english words 
                {
                    synth.Rate = espeechRate;
                    pb.ClearContent();
                    pb.AppendSsmlMarkup("<voice xml:lang=\"en-US\">");
                    pb.AppendText(e_word);
                    pb.AppendSsmlMarkup("</voice>");
                    if (radioButton4.Checked == true) synth.SpeakAsync(pb);  //start speech synthesizer
                    else
                    {
                        synth.Speak(pb); //jody fix
                        SystemSounds.Question.Play();
                    }
            
                    // in the english mode you can say the word or "wakaremasen"       
                    first_choice = j_word;
                    second_choice="わかれました";

                }

               
                if (bw.IsBusy != true) //&& (elapsedSeconds>nowtime))
                {
                    startGame = false;
                    bw.RunWorkerAsync();
                }

            } //end while startgame pause
    }//end timer


        //this is the background worker thread which does speech recognition 
        //builds grammar, sets recongizer input
        private void bw_DoWork(object sender, DoWorkEventArgs e)
        {
            BackgroundWorker worker = sender as BackgroundWorker;
            // recognizer.UpdateRecognizerSetting("CFGConfidenceRejectionThreshold", 80);
            // Create choices and grammar from previously set answer strings 
            Choices answers = new Choices(new string[] {first_choice, second_choice});
            GrammarBuilder gr = new GrammarBuilder(answers);
            //gr.Append(answers);
            gr.Culture = new System.Globalization.CultureInfo("ja-JP");
            recognizer.RequestRecognizerUpdate();
            recognizer.LoadGrammarAsync(new Grammar(gr));
            // Configure input to the speech recognizer.
            recognizer.SetInputToDefaultAudioDevice();
            // Start synchronous speech recognition.
            RecognitionResult result = recognizer.Recognize();
            if (result != null)
            {
                reconText = result.Text;
                reconConfidence = result.Confidence;
            }
            else
            {              
                reconText = "unrecognized:";            
            }
        }


        //background worker completion handler
        private void bw_RunWorkerCompleted(object sender, RunWorkerCompletedEventArgs e)
        {

           // synth.SpeakAsyncCancelAll();
            recognizer.RecognizeAsyncCancel();
            if (japanesemode == true)
            {
                if (reconText == first_choice)//know the japanese word--say good
                {
                   // pb.ClearContent();
                    //pb.AppendSsmlMarkup("<voice xml:lang=\"ja-JP\">");
                    //pb.AppendText("いい");
                   // pb.AppendSsmlMarkup("</voice>");
                    //synth.Speak(pb);

                    //if (UserStatistics.newstats.wordrecord[jmode,currentword] > 0) UserStatistics.newstats.wordrecord[jmode,currentword]--;
                    newstats.successwordcount++;
                    pleaserepeatword = false;
                    textBox3.Clear();
                    textBox3.AppendText(newstats.successwordcount.ToString());
                    mistakenumber = 0;
                    if (newstats.successwordcount < 100) pictureBox1.Image = Properties.Resources.cat1;
                    else if (newstats.successwordcount < 500) pictureBox1.Image = Properties.Resources.cat2;
                    else if (newstats.successwordcount < 1000) pictureBox1.Image = Properties.Resources.cat3;
                    else if (newstats.successwordcount < 2000) pictureBox1.Image = Properties.Resources.cat4;
                    pictureBox1.Refresh();
                    pictureBox1.Visible = true;

                }
                else if (reconText == second_choice) //don't know the word--say english
                {
                    pb.ClearContent();
                    pb.AppendSsmlMarkup("<voice xml:lang=\"en-US\">");
                    pb.AppendText(e_word);
                    pb.AppendSsmlMarkup("</voice>");
                    if (radioButton4.Checked == true) synth.SpeakAsync(pb);  //start speech synthesizer
                    else synth.Speak(pb); //jody fix
                    pleaserepeatword = true;
                    mistakenumber++;
                    //if (UserStatistics.newstats.wordrecord[jmode,currentword] <4) UserStatistics.newstats.wordrecord[jmode,currentword]= UserStatistics.newstats.wordrecord[jmode,currentword]+2;
                    if (mistakenumber>2) pleaserepeatword = false;
                   
                }
                else
                {
                    pb.ClearContent();
                    pb.AppendSsmlMarkup("<voice xml:lang=\"en-US\">");
                    pb.AppendText(e_word);
                    pb.AppendSsmlMarkup("</voice>");
                    if (radioButton4.Checked == true) synth.SpeakAsync(pb);  //start speech synthesizer
                    else synth.Speak(pb); //jody fix
                    pleaserepeatword = true;
                    mistakenumber++;
                    //if (UserStatistics.newstats.wordrecord[jmode,currentword] < 4) UserStatistics.newstats.wordrecord[jmode,currentword] = UserStatistics.newstats.wordrecord[jmode,currentword] + 2;
                    if (mistakenumber > 2) pleaserepeatword = false;
                }
            }
            else //english word
            {
                if (reconText == first_choice) //know the japanese--say nice job
                {
                    pb.ClearContent();
                    pb.AppendSsmlMarkup("<voice xml:lang=\"ja-JP\">");
                    int caseSwitch = rand1.Next(1, 5);
                        
                    switch (caseSwitch)
                    {
                        case 1:
                            pb.AppendText("はい。" + j_word);
                            break;
                        case 2:
                            pb.AppendText("うん。" + j_word);
                            break;
                        case 3:
                            pb.AppendText("ええ。" + j_word);
                            break;
                        case 4:
                            pb.AppendText("そうです。" + j_word);
                            break;
                        default:
                            pb.AppendText("もうちろん。" + j_word);
                            break;
                    }

                   


                    pb.AppendSsmlMarkup("</voice>");
                    if (radioButton4.Checked == true) synth.SpeakAsync(pb);  //start speech synthesizer
                    else synth.Speak(pb); //jody fix

                    // if (UserStatistics.newstats.wordrecord[jmode,currentword] > 0) UserStatistics.newstats.wordrecord[jmode,currentword]--;
                    mistakenumber = 0;
                    if (newstats.successwordcount < 100) pictureBox1.Image = Properties.Resources.cat1;
                    else if (newstats.successwordcount < 500) pictureBox1.Image = Properties.Resources.cat2;
                    else if (newstats.successwordcount < 1000) pictureBox1.Image = Properties.Resources.cat3;
                    else if (newstats.successwordcount < 2000) pictureBox1.Image = Properties.Resources.cat4;
                    newstats.successwordcount++;
                    pleaserepeatword = false;
                    textBox3.Clear();
                    textBox3.AppendText(newstats.successwordcount.ToString());
                }
                else if (reconText == second_choice) //don't know the word, say it.
                {
                    pb.ClearContent();
                    pb.AppendSsmlMarkup("<voice xml:lang=\"ja-JP\">");
                    pb.AppendText(j_word);
                    pb.AppendSsmlMarkup("</voice>");
                    if (radioButton4.Checked == true) synth.SpeakAsync(pb);  //start speech synthesizer
                    else synth.Speak(pb); //jody fix
                    pleaserepeatword = true;
                    mistakenumber++;
                    //MessageBox.Show("mistakenumber "+mistakenumber);
                    // if (UserStatistics.newstats.wordrecord[jmode,currentword] < 4) UserStatistics.newstats.wordrecord[jmode,currentword] = UserStatistics.newstats.wordrecord[jmode,currentword] + 2;
                    // else pleaserepeatword = false;
                    if (mistakenumber > 2) pleaserepeatword = false;
                }
                else
                {
                    pb.ClearContent();
                    pb.AppendSsmlMarkup("<voice xml:lang=\"ja-JP\">");
                    pb.AppendText("いいえ。" + j_word);
                    pb.AppendSsmlMarkup("</voice>");
                    if (radioButton4.Checked == true) synth.SpeakAsync(pb);  //start speech synthesizer
                    else synth.Speak(pb); //jody fix
                    //MessageBox.Show("default no recognize");
                    pleaserepeatword = true;
                    mistakenumber++;
                    //MessageBox.Show("mistakenumber " + mistakenumber);
                    //if (UserStatistics.newstats.wordrecord[jmode,currentword] < 4) UserStatistics.newstats.wordrecord[jmode,currentword] = UserStatistics.newstats.wordrecord[jmode,currentword] + 2;
                    //else pleaserepeatword = false;
                    if (mistakenumber > 2) pleaserepeatword = false;
                }
            }

            textBox4.Clear();
            textBox4.AppendText(""+reconConfidence);
            //textBox2.AppendText("  recognized text: " + reconText + "\n");
            //textBox2.AppendText("  Confidence score: " + reconConfidence + "\n");
            //textBox2.AppendText("error history:" + newstats.wordrecord[jmode,currentword] + "\n");
            startGame = true;
           specialfound = false;
        }

        //lots of little UI events****************************
        //****************************************************

        private void Form1_Load(object sender, EventArgs e)
        {//form1 (main form) load event
            groupBox3.Visible = false;          
            groupBox2.Visible = false;
            groupBox1.Visible = false;
        }


        private void newToolStripMenuItem_Click(object sender, EventArgs e)
        {//code for new user initialization goes here
            dataisloaded = true; //not needed
            button3.Visible = true;
            checkBox1.Checked = true;
        
        }
//Open Menu Item
        private void openToolStripMenuItem_Click(object sender, EventArgs e)
        {//open file dialog
            string Chosen_File = "";
            
            openFileDialog1.Title = "Open Statistics";
            openFileDialog1.InitialDirectory = System.Environment.GetFolderPath(Environment.SpecialFolder.Personal);
            openFileDialog1.FileName = "statistics";
            openFileDialog1.Filter = "Stat|*.ini";         
           
            if (openFileDialog1.ShowDialog() == DialogResult.Cancel)
            {
                MessageBox.Show("Operation Cancelled");
            }
            else
            {
                Chosen_File = openFileDialog1.FileName;
                //MessageBox.Show(Chosen_File);
                FileStream fs = new FileStream(Chosen_File, FileMode.Open);
                try
                {
                    BinaryFormatter formatter = new BinaryFormatter();

                  
                    newstats = (Userstatistics)formatter.Deserialize(fs);
                }
                catch (SerializationException t)
                {
                    MessageBox.Show("failed to serialize:" + t.Message);
                    throw;
                }
                finally
                {
                    fs.Close();
                }

                //MessageBox.Show(newstats.successwordcount.ToString());
                if (newstats.chapterselection[1]) checkBox1.Checked = true; else checkBox1.Checked = false;
                if (newstats.chapterselection[2]) checkBox2.Checked = true; else checkBox2.Checked = false;
                if (newstats.chapterselection[3]) checkBox3.Checked = true; else checkBox3.Checked = false;
                if (newstats.chapterselection[4]) checkBox4.Checked = true; else checkBox4.Checked = false;
                if (newstats.chapterselection[5]) checkBox5.Checked = true; else checkBox5.Checked = false;
                if (newstats.chapterselection[6]) checkBox6.Checked = true; else checkBox6.Checked = false;
                if (newstats.chapterselection[7]) checkBox7.Checked = true; else checkBox7.Checked = false;
                if (newstats.chapterselection[8]) checkBox8.Checked = true; else checkBox8.Checked = false;
                if (newstats.chapterselection[9]) checkBox9.Checked = true; else checkBox9.Checked = false;
                if (newstats.chapterselection[10]) checkBox10.Checked = true; else checkBox10.Checked = false;
                if (newstats.chapterselection[11]) checkBox11.Checked = true; else checkBox11.Checked = false;
                if (newstats.chapterselection[12]) checkBox12.Checked = true; else checkBox12.Checked = false;
                if (newstats.chapterselection[13]) checkBox13.Checked = true; else checkBox13.Checked = false;
                if (newstats.chapterselection[14]) checkBox14.Checked = true; else checkBox14.Checked = false;
                if (newstats.chapterselection[15]) checkBox15.Checked = true; else checkBox15.Checked = false;
                if (newstats.chapterselection[16]) checkBox16.Checked = true; else checkBox16.Checked = false;
                if (newstats.chapterselection[17]) checkBox17.Checked = true; else checkBox17.Checked = false;
                if (newstats.chapterselection[18]) checkBox18.Checked = true; else checkBox18.Checked = false;
                if (newstats.chapterselection[19]) checkBox19.Checked = true; else checkBox19.Checked = false;
                if (newstats.chapterselection[20]) checkBox20.Checked = true; else checkBox20.Checked = false;
                if (newstats.chapterselection[21]) checkBox21.Checked = true; else checkBox21.Checked = false;
                if (newstats.chapterselection[22]) checkBox22.Checked = true; else checkBox22.Checked = false;
                if (newstats.chapterselection[23]) checkBox23.Checked = true; else checkBox23.Checked = false;
                if (newstats.chapterselection[24]) checkBox24.Checked = true; else checkBox24.Checked = false;
                if (newstats.chapterselection[25]) checkBox25.Checked = true; else checkBox25.Checked = false;
                if (newstats.chapterselection[26]) checkBox26.Checked = true; else checkBox26.Checked = false;
                if (newstats.chapterselection[27]) checkBox27.Checked = true; else checkBox27.Checked = false;
                if (newstats.chapterselection[28]) checkBox28.Checked = true; else checkBox28.Checked = false;
                if (newstats.chapterselection[29]) checkBox29.Checked = true; else checkBox29.Checked = false;
                if (newstats.chapterselection[30]) checkBox30.Checked = true; else checkBox30.Checked = false;
                if (newstats.chapterselection[31]) checkBox31.Checked = true; else checkBox31.Checked = false;
                if (newstats.chapterselection[32]) checkBox32.Checked = true; else checkBox32.Checked = false;
                if (newstats.chapterselection[33]) checkBox33.Checked = true; else checkBox33.Checked = false;
                if (newstats.chapterselection[34]) checkBox34.Checked = true; else checkBox34.Checked = false;
                if (newstats.chapterselection[35]) checkBox35.Checked = true; else checkBox35.Checked = false;
                if (newstats.chapterselection[36]) checkBox36.Checked = true; else checkBox36.Checked = false;
                if (newstats.chapterselection[37]) checkBox37.Checked = true; else checkBox37.Checked = false;
                if (newstats.chapterselection[38]) checkBox38.Checked = true; else checkBox38.Checked = false;
                if (newstats.chapterselection[39]) checkBox39.Checked = true; else checkBox39.Checked = false;
                if (newstats.chapterselection[40]) checkBox40.Checked = true; else checkBox40.Checked = false;
                if (newstats.chapterselection[41]) checkBox41.Checked = true; else checkBox41.Checked = false;
                if (newstats.chapterselection[42]) checkBox42.Checked = true; else checkBox42.Checked = false;
                if (newstats.chapterselection[43]) checkBox43.Checked = true; else checkBox43.Checked = false;
                if (newstats.chapterselection[44]) checkBox44.Checked = true; else checkBox44.Checked = false;
                if (newstats.chapterselection[45]) checkBox45.Checked = true; else checkBox45.Checked = false;

                if (newstats.modeselection[1]) radioButton1.Checked = true; else radioButton1.Checked = false;
                if (newstats.modeselection[2]) radioButton2.Checked = true; else radioButton2.Checked = false;
                if (newstats.modeselection[3]) radioButton3.Checked = true; else radioButton3.Checked = false;
                if (newstats.modeselection[4]) radioButton4.Checked = true; else radioButton4.Checked =  false;

                dataisloaded = true;
                button3.Visible = true;
                textBox3.AppendText(newstats.successwordcount.ToString());
               
            }
        }
//Save Menu Item
        private void saveToolStripMenuItem_Click(object sender, EventArgs e)
        {//save file dialog
            string Saved_File = "";
            saveFileDialog1.Title = "Save Statistics";
            saveFileDialog1.InitialDirectory = System.Environment.GetFolderPath(Environment.SpecialFolder.Personal);
            saveFileDialog1.FileName = "";
            saveFileDialog1.Filter = "Stat|*.ini";

            if (saveFileDialog1.ShowDialog() == DialogResult.Cancel)
            {//cancel the file save
                MessageBox.Show("Operation Cancelled");
            }
            else
            { //do the actual saving 

                //transfer the check box status
                if (checkBox1.Checked) newstats.chapterselection[1] = true; else newstats.chapterselection[1] = false;
                if (checkBox2.Checked) newstats.chapterselection[2] = true; else newstats.chapterselection[2] = false;
                if (checkBox3.Checked) newstats.chapterselection[3] = true; else newstats.chapterselection[3] = false;
                if (checkBox4.Checked) newstats.chapterselection[4] = true; else newstats.chapterselection[4] = false;
                if (checkBox5.Checked) newstats.chapterselection[5] = true; else newstats.chapterselection[5] = false;
                if (checkBox6.Checked) newstats.chapterselection[6] = true; else newstats.chapterselection[6] = false;
                if (checkBox7.Checked) newstats.chapterselection[7] = true; else newstats.chapterselection[7] = false;
                if (checkBox8.Checked) newstats.chapterselection[8] = true; else newstats.chapterselection[8] = false;
                if (checkBox9.Checked) newstats.chapterselection[9] = true; else newstats.chapterselection[9] = false;
                if (checkBox10.Checked) newstats.chapterselection[10] = true; else newstats.chapterselection[10] = false;
                if (checkBox11.Checked) newstats.chapterselection[11] = true; else newstats.chapterselection[11] = false;
                if (checkBox12.Checked) newstats.chapterselection[12] = true; else newstats.chapterselection[12] = false;
                if (checkBox13.Checked) newstats.chapterselection[13] = true; else newstats.chapterselection[13] = false;
                if (checkBox14.Checked) newstats.chapterselection[14] = true; else newstats.chapterselection[14] = false;
                if (checkBox15.Checked) newstats.chapterselection[15] = true; else newstats.chapterselection[15] = false;
                if (checkBox16.Checked) newstats.chapterselection[16] = true; else newstats.chapterselection[16] = false;
                if (checkBox17.Checked) newstats.chapterselection[17] = true; else newstats.chapterselection[17] = false;
                if (checkBox18.Checked) newstats.chapterselection[18] = true; else newstats.chapterselection[18] = false;
                if (checkBox19.Checked) newstats.chapterselection[19] = true; else newstats.chapterselection[19] = false;
                if (checkBox20.Checked) newstats.chapterselection[20] = true; else newstats.chapterselection[20] = false;
                if (checkBox21.Checked) newstats.chapterselection[21] = true; else newstats.chapterselection[21] = false;
                if (checkBox22.Checked) newstats.chapterselection[22] = true; else newstats.chapterselection[22] = false;
                if (checkBox23.Checked) newstats.chapterselection[23] = true; else newstats.chapterselection[23] = false;
                if (checkBox24.Checked) newstats.chapterselection[24] = true; else newstats.chapterselection[24] = false;
                if (checkBox25.Checked) newstats.chapterselection[25] = true; else newstats.chapterselection[25] = false;
                if (checkBox26.Checked) newstats.chapterselection[26] = true; else newstats.chapterselection[26] = false;
                if (checkBox27.Checked) newstats.chapterselection[27] = true; else newstats.chapterselection[27] = false;
                if (checkBox28.Checked) newstats.chapterselection[28] = true; else newstats.chapterselection[28] = false;
                if (checkBox29.Checked) newstats.chapterselection[29] = true; else newstats.chapterselection[29] = false;
                if (checkBox30.Checked) newstats.chapterselection[30] = true; else newstats.chapterselection[30] = false;
                if (checkBox31.Checked) newstats.chapterselection[31] = true; else newstats.chapterselection[31] = false;
                if (checkBox32.Checked) newstats.chapterselection[32] = true; else newstats.chapterselection[32] = false;
                if (checkBox33.Checked) newstats.chapterselection[33] = true; else newstats.chapterselection[33] = false;
                if (checkBox34.Checked) newstats.chapterselection[34] = true; else newstats.chapterselection[34] = false;
                if (checkBox35.Checked) newstats.chapterselection[35] = true; else newstats.chapterselection[35] = false;
                if (checkBox36.Checked) newstats.chapterselection[36] = true; else newstats.chapterselection[36] = false;
                if (checkBox37.Checked) newstats.chapterselection[37] = true; else newstats.chapterselection[37] = false;
                if (checkBox38.Checked) newstats.chapterselection[38] = true; else newstats.chapterselection[38] = false;
                if (checkBox39.Checked) newstats.chapterselection[39] = true; else newstats.chapterselection[39] = false;
                if (checkBox40.Checked) newstats.chapterselection[40] = true; else newstats.chapterselection[40] = false;
                if (checkBox41.Checked) newstats.chapterselection[41] = true; else newstats.chapterselection[41] = false;
                if (checkBox42.Checked) newstats.chapterselection[42] = true; else newstats.chapterselection[42] = false;
                if (checkBox43.Checked) newstats.chapterselection[43] = true; else newstats.chapterselection[43] = false;
                if (checkBox44.Checked) newstats.chapterselection[44] = true; else newstats.chapterselection[44] = false;
                if (checkBox45.Checked) newstats.chapterselection[45] = true; else newstats.chapterselection[45] = false;

                if (radioButton1.Checked) newstats.modeselection[1] = true; else newstats.modeselection[1] = false;
                if (radioButton2.Checked) newstats.modeselection[2] = true; else newstats.modeselection[2] = false;
                if (radioButton3.Checked) newstats.modeselection[3] = true; else newstats.modeselection[3] = false;
                if (radioButton4.Checked) newstats.modeselection[4] = true; else newstats.modeselection[4] = false;


                Saved_File = saveFileDialog1.FileName;
                //MessageBox.Show(checkBox2.Checked.ToString());
               // MessageBox.Show(Saved_File);
                FileStream fs = new FileStream(Saved_File, FileMode.Create);
                BinaryFormatter formatter = new BinaryFormatter();
                try
                {                                               
                       formatter.Serialize(fs, newstats);                   
                }
                catch (SerializationException t)
                {
                    MessageBox.Show("failed to serialize:"+ t.Message);
                }
                finally
                {
                    fs.Close();
                }
               
            }

        }
//Quit Menu Item
        private void quitToolStripMenuItem_Click(object sender, EventArgs e)
        {//quit dialog
            if (MessageBox.Show("Do you want to Quit?", "Exit", MessageBoxButtons.OKCancel) == DialogResult.OK)
            {

                Application.Exit();

            }
        }

        //Properties Menu Item
        private void propertiesToolStripMenuItem_Click(object sender, EventArgs e)
        {//properties menu dialog
            groupBox1.Visible = true;
        }

        private void button1_Click(object sender, EventArgs e)
        {//properties box close button click
            if (MessageBox.Show("Do you want to Quit?", "Exit", MessageBoxButtons.OKCancel) == DialogResult.OK)
            {

                Application.Exit();

            }
        }
//Advance menu Item
        private void advancedToolStripMenuItem_Click(object sender, EventArgs e)
        {//open advance menu event
            groupBox2.Visible = true;
        }

       
        private void button2_Click(object sender, EventArgs e)
        { //advanced menu close button event
            groupBox2.Visible = false;
        }

        private void button3_Click(object sender, EventArgs e)
        {//start game button
            if (start_pause==0)
            {
                start_pause = 1;
                button3.Text = "pause";
                startGame = true;
                if (newstats.successwordcount < 100) pictureBox1.Image = Properties.Resources.cat1;
                else if (newstats.successwordcount < 500) pictureBox1.Image = Properties.Resources.cat2;
                else if (newstats.successwordcount < 1000) pictureBox1.Image = Properties.Resources.cat3;
                else if (newstats.successwordcount < 2000) pictureBox1.Image = Properties.Resources.cat4;
                pictureBox1.Refresh();
                pictureBox1.Visible = true;
                synth.Rate = jspeechRate;
                pb.AppendSsmlMarkup("<voice xml:lang=\"ja-JP\">");
                pb.AppendText("こにちは、友達。始めましょう。");
                pb.AppendSsmlMarkup("</voice>");
                if (radioButton4.Checked == true) synth.SpeakAsync(pb);  //start speech synthesizer
                else synth.Speak(pb); //jody fix
                                     

            }
            else if (start_pause == 1)
            {
                button3.Text = "start";               
                start_pause = 2;
            }
            else if (start_pause == 2)
            {
                button3.Text = "pause";              
                start_pause = 1;
            }

        }

        private void Form1_FormClosing(object sender, FormClosingEventArgs e)
        {
            DialogResult dialogResult= MessageBox.Show("save your data?","save reminder" ,MessageBoxButtons.YesNo);
            if (dialogResult==DialogResult.Yes)
            {
                {//save file dialog--someday make this a separate function
                    string Saved_File = "";
                    saveFileDialog1.Title = "Save Statistics";
                    saveFileDialog1.InitialDirectory = System.Environment.GetFolderPath(Environment.SpecialFolder.Personal);
                    saveFileDialog1.FileName = "";
                    saveFileDialog1.Filter = "Stat|*.ini";

                    if (saveFileDialog1.ShowDialog() == DialogResult.Cancel)
                    {//cancel the file save
                        MessageBox.Show("Operation Cancelled");
                    }
                    else
                    { //do the actual saving 

                        //transfer the check box status
                        if (checkBox1.Checked) newstats.chapterselection[1] = true; else newstats.chapterselection[1] = false;
                        if (checkBox2.Checked) newstats.chapterselection[2] = true; else newstats.chapterselection[2] = false;
                        if (checkBox3.Checked) newstats.chapterselection[3] = true; else newstats.chapterselection[3] = false;
                        if (checkBox4.Checked) newstats.chapterselection[4] = true; else newstats.chapterselection[4] = false;
                        if (checkBox5.Checked) newstats.chapterselection[5] = true; else newstats.chapterselection[5] = false;
                        if (checkBox6.Checked) newstats.chapterselection[6] = true; else newstats.chapterselection[6] = false;
                        if (checkBox7.Checked) newstats.chapterselection[7] = true; else newstats.chapterselection[7] = false;
                        if (checkBox8.Checked) newstats.chapterselection[8] = true; else newstats.chapterselection[8] = false;
                        if (checkBox9.Checked) newstats.chapterselection[9] = true; else newstats.chapterselection[9] = false;
                        if (checkBox10.Checked) newstats.chapterselection[10] = true; else newstats.chapterselection[10] = false;
                        if (checkBox11.Checked) newstats.chapterselection[11] = true; else newstats.chapterselection[11] = false;
                        if (checkBox12.Checked) newstats.chapterselection[12] = true; else newstats.chapterselection[12] = false;
                        if (checkBox13.Checked) newstats.chapterselection[13] = true; else newstats.chapterselection[13] = false;
                        if (checkBox14.Checked) newstats.chapterselection[14] = true; else newstats.chapterselection[14] = false;
                        if (checkBox15.Checked) newstats.chapterselection[15] = true; else newstats.chapterselection[15] = false;
                        if (checkBox16.Checked) newstats.chapterselection[16] = true; else newstats.chapterselection[16] = false;
                        if (checkBox17.Checked) newstats.chapterselection[17] = true; else newstats.chapterselection[17] = false;
                        if (checkBox18.Checked) newstats.chapterselection[18] = true; else newstats.chapterselection[18] = false;
                        if (checkBox19.Checked) newstats.chapterselection[19] = true; else newstats.chapterselection[19] = false;
                        if (checkBox20.Checked) newstats.chapterselection[20] = true; else newstats.chapterselection[20] = false;
                        if (checkBox21.Checked) newstats.chapterselection[21] = true; else newstats.chapterselection[21] = false;
                        if (checkBox22.Checked) newstats.chapterselection[22] = true; else newstats.chapterselection[22] = false;
                        if (checkBox23.Checked) newstats.chapterselection[23] = true; else newstats.chapterselection[23] = false;
                        if (checkBox24.Checked) newstats.chapterselection[24] = true; else newstats.chapterselection[24] = false;
                        if (checkBox25.Checked) newstats.chapterselection[25] = true; else newstats.chapterselection[25] = false;
                        if (checkBox26.Checked) newstats.chapterselection[26] = true; else newstats.chapterselection[26] = false;
                        if (checkBox27.Checked) newstats.chapterselection[27] = true; else newstats.chapterselection[27] = false;
                        if (checkBox28.Checked) newstats.chapterselection[28] = true; else newstats.chapterselection[28] = false;
                        if (checkBox29.Checked) newstats.chapterselection[29] = true; else newstats.chapterselection[29] = false;
                        if (checkBox30.Checked) newstats.chapterselection[30] = true; else newstats.chapterselection[30] = false;
                        if (checkBox31.Checked) newstats.chapterselection[31] = true; else newstats.chapterselection[31] = false;
                        if (checkBox32.Checked) newstats.chapterselection[32] = true; else newstats.chapterselection[32] = false;
                        if (checkBox33.Checked) newstats.chapterselection[33] = true; else newstats.chapterselection[33] = false;
                        if (checkBox34.Checked) newstats.chapterselection[34] = true; else newstats.chapterselection[34] = false;
                        if (checkBox35.Checked) newstats.chapterselection[35] = true; else newstats.chapterselection[35] = false;
                        if (checkBox36.Checked) newstats.chapterselection[36] = true; else newstats.chapterselection[36] = false;
                        if (checkBox37.Checked) newstats.chapterselection[37] = true; else newstats.chapterselection[37] = false;
                        if (checkBox38.Checked) newstats.chapterselection[38] = true; else newstats.chapterselection[38] = false;
                        if (checkBox39.Checked) newstats.chapterselection[39] = true; else newstats.chapterselection[39] = false;
                        if (checkBox40.Checked) newstats.chapterselection[40] = true; else newstats.chapterselection[40] = false;
                        if (checkBox41.Checked) newstats.chapterselection[41] = true; else newstats.chapterselection[41] = false;
                        if (checkBox42.Checked) newstats.chapterselection[42] = true; else newstats.chapterselection[42] = false;
                        if (checkBox43.Checked) newstats.chapterselection[43] = true; else newstats.chapterselection[43] = false;
                        if (checkBox44.Checked) newstats.chapterselection[44] = true; else newstats.chapterselection[44] = false;
                        if (checkBox45.Checked) newstats.chapterselection[45] = true; else newstats.chapterselection[45] = false;

                        if (radioButton1.Checked) newstats.modeselection[1] = true; else newstats.modeselection[1] = false;
                        if (radioButton2.Checked) newstats.modeselection[2] = true; else newstats.modeselection[2] = false;
                        if (radioButton3.Checked) newstats.modeselection[3] = true; else newstats.modeselection[3] = false;
                        if (radioButton4.Checked) newstats.modeselection[4] = true; else newstats.modeselection[4] = false;


                        Saved_File = saveFileDialog1.FileName;
                        //MessageBox.Show(checkBox2.Checked.ToString());
                        //MessageBox.Show(Saved_File);
                        FileStream fs = new FileStream(Saved_File, FileMode.Create);
                        BinaryFormatter formatter = new BinaryFormatter();
                        try
                        {
                            formatter.Serialize(fs, newstats);
                        }
                        catch (SerializationException t)
                        {
                            MessageBox.Show("failed to serialize:" + t.Message);
                        }
                        finally
                        {
                            fs.Close();
                        }

                    }

                }

            }
        }

        private void button4_Click(object sender, EventArgs e) //add special word
        {
            bool spacefound = false;
            for (int x = 0; x < 50; x++) //find next open space
            {
                if (newstats.superwords[x] == 0)
                {
                    if (spacefound==false) newstats.superwords[x] = previouslastcurrentword;
                    spacefound = true;
                }                  
            }  
            if (spacefound==false)//no space, random ejection
            {
               int x = rand1.Next(0, 50);
               newstats.superwords[x] = previouslastcurrentword;
            }
            MessageBox.Show("special word is" + previouslastcurrentword);
        }

        private void button5_Click(object sender, EventArgs e)
        {
            for (int x = 0; x < 50; x++) //remove
            {
                if (newstats.superwords[x] == currentword)
                { 
                    newstats.superwords[x] = 0;
                    MessageBox.Show("removed word is" + currentword);
                }
            }
            
        }

        private void pictureBox1_Click(object sender, EventArgs e)
        {

        }

        private void button6_Click(object sender, EventArgs e)
        {
            groupBox1.Visible = false;
        }

        //help screen
        private void helpToolStripMenuItem_Click(object sender, EventArgs e)
        {
            groupBox3.Visible = true;
        }

        private void button7_Click(object sender, EventArgs e)
        {
            groupBox3.Visible = false;
        }

       






        //*****************************
        //other miscelleneous functions







    }
}
